{
  "timestamp": "2025-11-23T12:53:53.370Z",
  "phraseType": "anonymous",
  "totalPhrases": 22,
  "phrases": [
    {
      "arabicText": "بِسمِ اللَّهِ الرَّحمٰنِ الرَّحيمِ",
      "englishText": "In the name of Allah, the Entirely Merciful, the Especially Merciful.",
      "hindiText": "अल्लाह के नाम से जो रहमान व रहीम है।",
      "urduText": "شروع کرتا ہوں اللہ تعالیٰ کے نام سے جو بڑا مہربان نہایت رحم واﻻ ہے",
      "phraseType": "anonymous",
      "references": [
        {
          "surahNumber": 1,
          "ayahNumber": 1
        }
      ]
    },
    {
      "arabicText": "وَلَتَجِدَنَّهُم أَحرَصَ النّاسِ عَلىٰ حَياةٍ وَمِنَ الَّذينَ أَشرَكوا ۚ يَوَدُّ أَحَدُهُم لَو يُعَمَّرُ أَلفَ سَنَةٍ وَما هُوَ بِمُزَحزِحِهِ مِنَ العَذابِ أَن يُعَمَّرَ ۗ وَاللَّهُ بَصيرٌ بِما يَعمَلونَ",
      "englishText": "And you will surely find them the most greedy of people for life - [even] more than those who associate others with Allah. One of them wishes that he could be granted life a thousand years, but it would not remove him in the least from the [coming] punishment that he should be granted life. And Allah is Seeing of what they do.",
      "hindiText": "और (ऐ रसूल) तुम उन ही को ज़िन्दगी का सबसे ज्यादा हरीस पाओगे और मुशरिक़ों में से हर एक शख्स चाहता है कि काश उसको हज़ार बरस की उम्र दी जाती हालाँकि अगर इतनी तूलानी उम्र भी दी जाए तो वह ख़ुदा के अज़ाब से छुटकारा देने वाली नहीं, और जो कुछ वह लोग करते हैं खुदा उसे देख रहा है",
      "urduText": "بلکہ سب سے زیاده دنیا کی زندگی کا حریص اے نبی! آپ انہیں کو پائیں گے۔ یہ حرص زندگی میں مشرکوں سے بھی زیاده ہیں ان میں سے تو ہر شخص ایک ایک ہزار سال کی عمر چاہتا ہے، گویا یہ عمر دیا جانا بھی انہیں عذاب سے نہیں چھڑا سکتا، اللہ تعالیٰ ان کے کاموں کو بخوبی دیکھ رہا ہے",
      "phraseType": "anonymous",
      "references": [
        {
          "surahNumber": 2,
          "ayahNumber": 96
        }
      ]
    },
    {
      "arabicText": "إِنَّما حَرَّمَ عَلَيكُمُ المَيتَةَ وَالدَّمَ وَلَحمَ الخِنزيرِ وَما أُهِلَّ بِهِ لِغَيرِ اللَّهِ ۖ فَمَنِ اضطُرَّ غَيرَ باغٍ وَلا عادٍ فَلا إِثمَ عَلَيهِ ۚ إِنَّ اللَّهَ غَفورٌ رَحيمٌ",
      "englishText": "He has only forbidden to you dead animals, blood, the flesh of swine, and that which has been dedicated to other than Allah. But whoever is forced [by necessity], neither desiring [it] nor transgressing [its limit], there is no sin upon him. Indeed, Allah is Forgiving and Merciful.",
      "hindiText": "उसने तो तुम पर बस मुर्दा जानवर और खून और सूअर का गोश्त और वह जानवर जिस पर ज़बह के वक्त ख़ुदा के सिवा और किसी का नाम लिया गया हो हराम किया है पस जो शख्स मजबूर हो और सरकशी करने वाला और ज्यादती करने वाला न हो (और उनमे से कोई चीज़ खा ले) तो उसपर गुनाह नहीं है बेशक ख़ुदा बड़ा बख्शने वाला मेहरबान है",
      "urduText": "تم پر مرده اور (بہا ہوا) خون اور سور کا گوشت اور ہر وه چیز جس پر اللہ کے سوا دوسروں کا نام پکارا گیا ہو حرام ہے پھر جو مجبور ہوجائے اور وه حد سے بڑھنے واﻻ اور زیادتی کرنے واﻻ نہ ہو، اس پر ان کے کھانے میں کوئی گناه نہیں، اللہ تعالیٰ بخشش کرنے واﻻ مہربان ہے",
      "phraseType": "anonymous",
      "references": [
        {
          "surahNumber": 2,
          "ayahNumber": 173
        }
      ]
    },
    {
      "arabicText": "يَسأَلونَكَ ماذا يُنفِقونَ ۖ قُل ما أَنفَقتُم مِن خَيرٍ فَلِلوالِدَينِ وَالأَقرَبينَ وَاليَتامىٰ وَالمَساكينِ وَابنِ السَّبيلِ ۗ وَما تَفعَلوا مِن خَيرٍ فَإِنَّ اللَّهَ بِهِ عَليمٌ",
      "englishText": "They ask you, [O Muhammad], what they should spend. Say, \"Whatever you spend of good is [to be] for parents and relatives and orphans and the needy and the traveler. And whatever you do of good - indeed, Allah is Knowing of it.\"",
      "hindiText": "(ऐ रसूल) तुमसे लोग पूछते हैं कि हम ख़ुदा की राह में क्या खर्च करें (तो तुम उन्हें) जवाब दो कि तुम अपनी नेक कमाई से जो कुछ खर्च करो तो (वह तुम्हारे माँ बाप और क़राबतदारों और यतीमों और मोहताजो और परदेसियों का हक़ है और तुम कोई नेक सा काम करो ख़ुदा उसको ज़रुर जानता है",
      "urduText": "آپ سے پوچھتے ہیں کہ وه کیا خرچ کریں؟ آپ کہہ دیجیئے جو مال تم خرچ کرو وه ماں باپ کے لئے ہے اور رشتہداروں اور یتیموں اور مسکینوں اور مسافروں کے لئے ہے اور تم جو کچھ بھلائی کرو گے اللہ تعالیٰ کو اس کا علم ہے",
      "phraseType": "anonymous",
      "references": [
        {
          "surahNumber": 2,
          "ayahNumber": 215
        }
      ]
    },
    {
      "arabicText": "كُتِبَ عَلَيكُمُ القِتالُ وَهُوَ كُرهٌ لَكُم ۖ وَعَسىٰ أَن تَكرَهوا شَيئًا وَهُوَ خَيرٌ لَكُم ۖ وَعَسىٰ أَن تُحِبّوا شَيئًا وَهُوَ شَرٌّ لَكُم ۗ وَاللَّهُ يَعلَمُ وَأَنتُم لا تَعلَمونَ",
      "englishText": "Fighting has been enjoined upon you while it is hateful to you. But perhaps you hate a thing and it is good for you; and perhaps you love a thing and it is bad for you. And Allah Knows, while you know not.",
      "hindiText": "(मुसलमानों) तुम पर जिहाद फर्ज क़िया गया अगरचे तुम पर शाक़ ज़रुर है और अजब नहीं कि तुम किसी चीज़ (जिहाद) को नापसन्द करो हालॉकि वह तुम्हारे हक़ में बेहतर हो और अजब नहीं कि तुम किसी चीज़ को पसन्द करो हालॉकि वह तुम्हारे हक़ में बुरी हो और ख़ुदा (तो) जानता ही है मगर तुम नही जानते हो",
      "urduText": "تم پر جہاد فرض کیا گیا گو وه تمہیں دشوار معلوم ہو، ممکن ہے کہ تم کسی چیز کو بری جانو اور دراصل وہی تمہارے لئے بھلی ہو اور یہ بھی ممکن ہے کہ تم کسی چیز کو اچھی سمجھو، حاﻻنکہ وه تمہارے لئے بری ہو، حقیقی علم اللہ ہی کو ہے، تم محض بےخبر ہو",
      "phraseType": "anonymous",
      "references": [
        {
          "surahNumber": 2,
          "ayahNumber": 216
        }
      ]
    },
    {
      "arabicText": "وَلا تَجعَلُوا اللَّهَ عُرضَةً لِأَيمانِكُم أَن تَبَرّوا وَتَتَّقوا وَتُصلِحوا بَينَ النّاسِ ۗ وَاللَّهُ سَميعٌ عَليمٌ",
      "englishText": "And do not make [your oath by] Allah an excuse against being righteous and fearing Allah and making peace among people. And Allah is Hearing and Knowing.",
      "hindiText": "और (मुसलमानों) तुम अपनी क़समों (के हीले) से ख़ुदा (के नाम) को लोगों के साथ सुलूक करने और ख़ुदा से डरने और लोगों के दरमियान सुलह करवा देने का मानेअ न ठहराव और ख़ुदा सबकी सुनता और सब को जानता है",
      "urduText": "اور اللہ تعالیٰ کو اپنی قسموں کا (اس طرح) نشانہ نہ بناؤ کہ بھلائی اور پرہیزگاری اور لوگوں کے درمیان کی اصلاح کو چھوڑ بیٹھو اور اللہ تعالیٰ سننے واﻻ جاننے واﻻ ہے",
      "phraseType": "anonymous",
      "references": [
        {
          "surahNumber": 2,
          "ayahNumber": 224
        }
      ]
    },
    {
      "arabicText": "وَلا تَتَّخِذوا آياتِ اللَّهِ هُزُوًا ۚ وَاذكُروا نِعمَتَ اللَّهِ عَلَيكُم وَما أَنزَلَ عَلَيكُم مِنَ الكِتابِ وَالحِكمَةِ يَعِظُكُم بِهِ ۚ وَاتَّقُوا اللَّهَ وَاعلَموا أَنَّ اللَّهَ بِكُلِّ شَيءٍ عَليمٌ",
      "englishText": "And do not take the verses of Allah in jest. And remember the favor of Allah upon you and what has been revealed to you of the Book and wisdom by which He instructs you. And fear Allah and know that Allah is Knowing of all things.",
      "hindiText": "और ख़ुदा के एहकाम को कुछ हँसी ठट्टा न समझो और ख़ुदा ने जो तुम्हें नेअमतें दी हैं उन्हें याद करो और जो किताब और अक्ल की बातें तुम पर नाज़िल की उनसे तुम्हारी नसीहत करता है और ख़ुदा से डरते रहो और समझ रखो कि ख़ुदा हर चीज़ को ज़रुर जानता है",
      "urduText": "تم اللہ کے احکام کو ہنسی کھیل نہ بناؤ اور اللہ کا احسان جو تم پر ہے یاد کرو اور جو کچھ کتاب وحکمت اس نے نازل فرمائی ہے جس سے تمہیں نصیحت کر رہا ہے، اسے بھی۔ اور اللہ تعالیٰ سے ڈرتے رہا کرو اور جان رکھو کہ اللہ تعالیٰ ہر چیز کو جانتا ہے",
      "phraseType": "anonymous",
      "references": [
        {
          "surahNumber": 2,
          "ayahNumber": 231
        }
      ]
    },
    {
      "arabicText": "وَاللَّهُ يَعلَمُ وَأَنتُم لا تَعلَمونَ",
      "englishText": "And Allah knows and you know not.",
      "hindiText": "और उसकी ख़ूबी ख़ुदा खूब जानता है और तुम (वैसा) नहीं जानते हो",
      "urduText": "اللہ تعالیٰ جانتا ہے اور تم نہیں جانتے",
      "phraseType": "anonymous",
      "references": [
        {
          "surahNumber": 2,
          "ayahNumber": 232
        }
      ]
    },
    {
      "arabicText": "وَاتَّقُوا اللَّهَ وَاعلَموا أَنَّ اللَّهَ بِما تَعمَلونَ بَصيرٌ",
      "englishText": "And fear Allah and know that Allah is Seeing of what you do.",
      "hindiText": "और ख़ुदा से डरते रहो और जान रखो कि जो कुछ तुम करते हो ख़ुदा ज़रुर देखता है",
      "urduText": "اللہ تعالیٰ سے ڈرتے رہو اور جانتے رہو کہ اللہ تعالیٰ تمہارے اعمال کی دیکھ بھال کر رہا ہے",
      "phraseType": "anonymous",
      "references": [
        {
          "surahNumber": 2,
          "ayahNumber": 233
        }
      ]
    },
    {
      "arabicText": "وَاعلَموا أَنَّ اللَّهَ يَعلَمُ ما في أَنفُسِكُم فَاحذَروهُ ۚ وَاعلَموا أَنَّ اللَّهَ غَفورٌ حَليمٌ",
      "englishText": "And know that Allah knows what is within yourselves, so beware of Him. And know that Allah is Forgiving and Forbearing.",
      "hindiText": "और समझ रखो कि जो कुछ तुम्हारी दिल में है ख़ुदा उस को ज़रुर जानता है तो उस से डरते रहो और (ये भी) जान लो कि ख़ुदा बड़ा बख्शने वाला बुर्दबार है",
      "urduText": "تم اس سے خوف کھاتے رہا کرو اور یہ بھی جان رکھو کہ اللہ تعالیٰ بخشش اور علم واﻻ ہے",
      "phraseType": "anonymous",
      "references": [
        {
          "surahNumber": 2,
          "ayahNumber": 235
        }
      ]
    },
    {
      "arabicText": "وَقاتِلوا في سَبيلِ اللَّهِ وَاعلَموا أَنَّ اللَّهَ سَميعٌ عَليمٌ",
      "englishText": "And fight in the cause of Allah and know that Allah is Hearing and Knowing.",
      "hindiText": "और मुसलमानों ख़ुदा की राह मे जिहाद करो और जान रखो कि ख़ुदा ज़रुर सब कुछ सुनता (और) जानता है",
      "urduText": "اللہ تعالیٰ کی راه میں جہاد کرو اور جان لو کہ اللہ تعالیٰ سنتا، جانتا ہے",
      "phraseType": "anonymous",
      "references": [
        {
          "surahNumber": 2,
          "ayahNumber": 244
        }
      ]
    },
    {
      "arabicText": "قالَ الَّذينَ يَظُنّونَ أَنَّهُم مُلاقُو اللَّهِ كَم مِن فِئَةٍ قَليلَةٍ غَلَبَت فِئَةً كَثيرَةً بِإِذنِ اللَّهِ ۗ وَاللَّهُ مَعَ الصّابِرينَ",
      "englishText": "But those who were certain that they would meet Allah said, \"How many a small company has overcome a large company by permission of Allah. And Allah is with the patient.\"",
      "hindiText": "मगर वह लोग जिनको यक़ीन है कि एक दिन ख़ुदा को मुँह दिखाना है बेधड़क बोल उठे कि ऐसा बहुत हुआ कि ख़ुदा के हुक्म से छोटी जमाअत बड़ी जमाअत पर ग़ालिब आ गयी है और ख़ुदा सब्र करने वालों का साथी है",
      "urduText": "لیکن اللہ تعالیٰ کی ملاقات پر یقین رکھنے والوں نے کہا، بسا اوقات چھوٹی اور تھوڑی سی جماعتیں بڑی اور بہت سی جماعتوں پر اللہ کے حکم سے غلبہ پالیتی ہیں، اللہ تعالیٰ صبر والوں کے ساتھ ہے",
      "phraseType": "anonymous",
      "references": [
        {
          "surahNumber": 2,
          "ayahNumber": 249
        }
      ]
    },
    {
      "arabicText": "وَلَولا دَفعُ اللَّهِ النّاسَ بَعضَهُم بِبَعضٍ لَفَسَدَتِ الأَرضُ وَلٰكِنَّ اللَّهَ ذو فَضلٍ عَلَى العالَمينَ",
      "englishText": "And if it were not for Allah checking [some] people by means of others, the earth would have been corrupted, but Allah is full of bounty to the worlds.",
      "hindiText": "और अगर ख़ुदा बाज़ लोगों के ज़रिए से बाज़ का दफाए (शर) न करता तो तमाम रुए ज़मीन पर फ़साद फैल जाता मगर ख़ुदा तो सारे जहाँन के लोगों पर फज़ल व रहम करता है",
      "urduText": "اگر اللہ تعالیٰ بعض لوگوں کو بعض سے دفع نہ کرتا تو زمین میں فساد پھیل جاتا، لیکن اللہ تعالیٰ دنیا والوں پر بڑا فضل وکرم کرنے واﻻ ہے",
      "phraseType": "anonymous",
      "references": [
        {
          "surahNumber": 2,
          "ayahNumber": 251
        }
      ]
    },
    {
      "arabicText": "أَلَم تَرَ إِلَى الَّذي حاجَّ إِبراهيمَ في رَبِّهِ أَن آتاهُ اللَّهُ المُلكَ إِذ قالَ إِبراهيمُ رَبِّيَ الَّذي يُحيي وَيُميتُ قالَ أَنا أُحيي وَأُميتُ ۖ قالَ إِبراهيمُ فَإِنَّ اللَّهَ يَأتي بِالشَّمسِ مِنَ المَشرِقِ فَأتِ بِها مِنَ المَغرِبِ فَبُهِتَ الَّذي كَفَرَ ۗ وَاللَّهُ لا يَهدِي القَومَ الظّالِمينَ",
      "englishText": "Have you not considered the one who argued with Abraham about his Lord [merely] because Allah had given him kingship? When Abraham said, \"My Lord is the one who gives life and causes death,\" he said, \"I give life and cause death.\" Abraham said, \"Indeed, Allah brings up the sun from the east, so bring it up from the west.\" So the disbeliever was overwhelmed [by astonishment], and Allah does not guide the wrongdoing people.",
      "hindiText": "(ऐ रसूल) क्या तुम ने उस शख्स (के हाल) पर नज़र नहीं की जो सिर्फ़ इस बिरते पर कि ख़ुदा ने उसे सल्तनत दी थी इब्राहीम से उनके परवरदिगार के बारे में उलझ पड़ा कि जब इब्राहीम ने (उससे) कहा कि मेरा परवरदिगार तो वह है जो (लोगों को) जिलाता और मारता है तो वो भी (शेख़ी में) आकर कहने लगा मैं भी जिलाता और मारता हूं (तुम्हारे ख़ुदा ही में कौन सा कमाल है) इब्राहीम ने कहा (अच्छा) खुदा तो आफ़ताब को पूरब से निकालता है भला तुम उसको पश्चिम से निकालो इस पर वह काफ़िर हक्का बक्का हो कर रह गया (मगर ईमान न लाया) और ख़ुदा ज़ालिमों को मंज़िले मक़सूद तक नहीं पहुंचाया करता",
      "urduText": "کیا تونے اسے نہیں دیکھا جو سلطنت پا کر ابراہیم (علیہ السلام) سے اس کے رب کے بارے میں جھگڑ رہا تھا، جب ابراہیم (علیہ السلام) نے کہا کہ میرا رب تو وه ہے جو جلاتا ہے اور مارتا ہے، وه کہنے لگا میں بھی جلاتا اور مارتا ہوں، ابراہیم (علیہ السلام) نے کہا اللہ تعالیٰ سورج کو مشرق کی طرف سے لے آتا ہے تو اسے مغرب کی جانب سے لے آ۔ اب تو وه کافر بھونچکا ره گیا، اور اللہ تعالیٰ ﻇالموں کو ہدایت نہیں دیتا",
      "phraseType": "anonymous",
      "references": [
        {
          "surahNumber": 2,
          "ayahNumber": 258
        }
      ]
    },
    {
      "arabicText": "أَو كَالَّذي مَرَّ عَلىٰ قَريَةٍ وَهِيَ خاوِيَةٌ عَلىٰ عُروشِها قالَ أَنّىٰ يُحيي هٰذِهِ اللَّهُ بَعدَ مَوتِها ۖ فَأَماتَهُ اللَّهُ مِائَةَ عامٍ ثُمَّ بَعَثَهُ ۖ قالَ كَم لَبِثتَ ۖ قالَ لَبِثتُ يَومًا أَو بَعضَ يَومٍ ۖ قالَ بَل لَبِثتَ مِائَةَ عامٍ فَانظُر إِلىٰ طَعامِكَ وَشَرابِكَ لَم يَتَسَنَّه ۖ وَانظُر إِلىٰ حِمارِكَ وَلِنَجعَلَكَ آيَةً لِلنّاسِ ۖ وَانظُر إِلَى العِظامِ كَيفَ نُنشِزُها ثُمَّ نَكسوها لَحمًا ۚ فَلَمّا تَبَيَّنَ لَهُ قالَ أَعلَمُ أَنَّ اللَّهَ عَلىٰ كُلِّ شَيءٍ قَديرٌ",
      "englishText": "Or [consider such an example] as the one who passed by a township which had fallen into ruin. He said, \"How will Allah bring this to life after its death?\" So Allah caused him to die for a hundred years; then He revived him. He said, \"How long have you remained?\" The man said, \"I have remained a day or part of a day.\" He said, \"Rather, you have remained one hundred years. Look at your food and your drink; it has not changed with time. And look at your donkey; and We will make you a sign for the people. And look at the bones [of this donkey] - how We raise them and then We cover them with flesh.\" And when it became clear to him, he said, \"I know that Allah is over all things competent.\"",
      "hindiText": "(ऐ रसूल तुमने) मसलन उस (बन्दे के हाल पर भी नज़र की जो एक गॉव पर से होकर गुज़रा और वो ऐसा उजड़ा था कि अपनी छतों पर से ढह के गिर पड़ा था ये देखकर वह बन्दा (कहने लगा) अल्लाह अब इस गॉव को ऐसी वीरानी के बाद क्योंकर आबाद करेगा इस पर ख़ुदा ने उसको (मार डाला) सौ बरस तक मुर्दा रखा फिर उसको जिला उठाया (तब) पूछा तुम कितनी देर पड़े रहे अर्ज क़ी एक दिन पड़ा रहा एक दिन से भी कम फ़रमाया नहीं तुम (इसी हालत में) सौ बरस पड़े रहे अब ज़रा अपने खाने पीने (की चीज़ों) को देखो कि बुसा तक नहीं और ज़रा अपने गधे (सवारी) को तो देखो कि उसकी हड्डियाँ ढेर पड़ी हैं और सब इस वास्ते किया है ताकि लोगों के लिये तुम्हें क़ुदरत का नमूना बनाये और अच्छा अब (इस गधे की) हड्डियों की तरफ़ नज़र करो कि हम क्योंकर जोड़ जाड़ कर ढाँचा बनाते हैं फिर उनपर गोश्त चढ़ाते हैं पस जब ये उनपर ज़ाहिर हुआ तो बेसाख्ता बोल उठे कि (अब) मैं ये यक़ीने कामिल जानता हूं कि ख़ुदा हर चीज़ पर क़ादिर है",
      "urduText": "یا اس شخص کے مانند کہ جس کا گزر اس بستی پر ہوا جو چھت کے بل اوندھی پڑی ہوئی تھی، وه کہنے لگا اس کی موت کے بعد اللہ تعالیٰ اسے کس طرح زنده کرے گا؟ تو اللہ تعالی نے اسے مار دیا سو سال کے لئے، پھر اسے اٹھایا، پوچھا کتنی مدت تجھ پر گزری؟ کہنے لگا ایک دن یا دن کا کچھ حصہ، فرمایا بلکہ تو سو سال تک رہا، پھر اب تو اپنے کھانے پینے کو دیکھ کہ بالکل خراب نہیں ہوا اور اپنے گدھے کو بھی دیکھ، ہم تجھے لوگوں کے لئے ایک نشانی بناتے ہیں تو دیکھ کہ ہم ہڈیوں کو کس طرح اٹھاتے ہیں، پھر ان پر گوشت چڑھاتے ہیں، جب یہ سب ﻇاہر ہو چکا تو کہنے لگا میں جانتا ہوں کہ اللہ تعالیٰ ہر چیز پر قادر ہے",
      "phraseType": "anonymous",
      "references": [
        {
          "surahNumber": 2,
          "ayahNumber": 259
        }
      ]
    },
    {
      "arabicText": "وَإِذ قالَ إِبراهيمُ رَبِّ أَرِني كَيفَ تُحيِي المَوتىٰ ۖ قالَ أَوَلَم تُؤمِن ۖ قالَ بَلىٰ وَلٰكِن لِيَطمَئِنَّ قَلبي ۖ قالَ فَخُذ أَربَعَةً مِنَ الطَّيرِ فَصُرهُنَّ إِلَيكَ ثُمَّ اجعَل عَلىٰ كُلِّ جَبَلٍ مِنهُنَّ جُزءًا ثُمَّ ادعُهُنَّ يَأتينَكَ سَعيًا ۚ وَاعلَم أَنَّ اللَّهَ عَزيزٌ حَكيمٌ",
      "englishText": "And [mention] when Abraham said, \"My Lord, show me how You give life to the dead.\" [Allah] said, \"Have you not believed?\" He said, \"Yes, but [I ask] only that my heart may be satisfied.\" [Allah] said, \"Take four birds and commit them to yourself. Then [after slaughtering them] put on each hill a portion of them; then call them - they will come [flying] to you in haste. And know that Allah is Exalted in Might and Wise.\"",
      "hindiText": "और (ऐ रसूल) वह वाकेया भी याद करो जब इबराहीम ने (खुदा से) दरख्वास्त की कि ऐ मेरे परवरदिगार तू मुझे भी तो दिखा दे कि तू मुर्दों को क्योंकर ज़िन्दा करता है ख़ुदा ने फ़रमाया क्या तुम्हें (इसका) यक़ीन नहीं इबराहीम ने अर्ज़ की (क्यों नहीं) यक़ीन तो है मगर ऑंख से देखना इसलिए चाहता हूं कि मेरे दिल को पूरा इत्मिनान हो जाए फ़रमाया (अगर ये चाहते हो) तो चार परिन्दे लो और उनको अपने पास मॅगवा लो और टुकड़े टुकड़े कर डालो फिर हर पहाड़ पर उनका एक एक टुकड़ा रख दो उसके बाद उनको बुलाओ (फिर देखो तो क्यों कर वह सब के सब तुम्हारे पास दौड़े हुए आते हैं और समझ रखो कि ख़ुदा बेशक ग़ालिब और हिकमत वाला है",
      "urduText": "اور جب ابراہیم (علیہ السلام) نے کہا کہ اے میرے پروردگار! مجھے دکھا تو مُردوں کو کس طرح زنده کرے گا؟ (جناب باری تعالیٰ نے) فرمایا، کیا تمہیں ایمان نہیں؟ جواب دیا ایمان تو ہے لیکن میرے دل کی تسکین ہو جائے گی، فرمایا چار پرند لو، ان کے ٹکڑے کر ڈالو، پھر ہر پہاڑ پر ان کا ایک ایک ٹکڑا رکھ دو پھر انہیں پکارو، تمہارے پاس دوڑتے ہوئے آجائیں گے اور جان رکھو کہ اللہ تعالیٰ غالب ہے حکمتوں واﻻ ہے",
      "phraseType": "anonymous",
      "references": [
        {
          "surahNumber": 2,
          "ayahNumber": 260
        }
      ]
    },
    {
      "arabicText": "مَثَلُ الَّذينَ يُنفِقونَ أَموالَهُم في سَبيلِ اللَّهِ كَمَثَلِ حَبَّةٍ أَنبَتَت سَبعَ سَنابِلَ في كُلِّ سُنبُلَةٍ مِائَةُ حَبَّةٍ ۗ وَاللَّهُ يُضاعِفُ لِمَن يَشاءُ ۗ وَاللَّهُ واسِعٌ عَليمٌ",
      "englishText": "The example of those who spend their wealth in the way of Allah is like a seed [of grain] which grows seven spikes; in each spike is a hundred grains. And Allah multiplies [His reward] for whom He wills. And Allah is all-Encompassing and Knowing.",
      "hindiText": "जो लोग अपने माल खुदा की राह में खर्च करते हैं उनके (खर्च) की मिसाल उस दाने की सी मिसाल है जिसकी सात बालियॉ निकलें (और) हर बाली में सौ (सौ) दाने हों और ख़ुदा जिसके लिये चाहता है दूना कर देता है और खुदा बड़ी गुन्जाइश वाला (हर चीज़ से) वाक़िफ़ है",
      "urduText": "جو لوگ اپنا مال اللہ تعالیٰ کی راه میں خرچ کرتے ہیں اس کی مثال اس دانے جیسی ہے جس میں سے سات بالیاں نکلیں اور ہر بالی میں سودانے ہوں، اور اللہ تعالیٰ جسے چاہے بڑھا چڑھا کر دے اور اللہ تعالیٰ کشادگی واﻻ اور علم واﻻ ہے",
      "phraseType": "anonymous",
      "references": [
        {
          "surahNumber": 2,
          "ayahNumber": 261
        }
      ]
    },
    {
      "arabicText": "قَولٌ مَعروفٌ وَمَغفِرَةٌ خَيرٌ مِن صَدَقَةٍ يَتبَعُها أَذًى",
      "englishText": "Kind speech and forgiveness are better than charity followed by injury.",
      "hindiText": "(सायल को) नरमी से जवाब दे देना और (उसके इसरार पर न झिड़कना बल्कि) उससे दरगुज़र करना उस खैरात से कहीं बेहतर है जिसके बाद (सायल को) ईज़ा पहुंचे",
      "urduText": "نرم بات کہنا اور معاف کردینا اس صدقہ سے بہتر ہے جس کے بعد ایذا رسانی ہو",
      "phraseType": "anonymous",
      "references": [
        {
          "surahNumber": 2,
          "ayahNumber": 263
        }
      ]
    },
    {
      "arabicText": "وَمَثَلُ الَّذينَ يُنفِقونَ أَموالَهُمُ ابتِغاءَ مَرضاتِ اللَّهِ وَتَثبيتًا مِن أَنفُسِهِم كَمَثَلِ جَنَّةٍ بِرَبوَةٍ أَصابَها وابِلٌ فَآتَت أُكُلَها ضِعفَينِ فَإِن لَم يُصِبها وابِلٌ فَطَلٌّ",
      "englishText": "And the example of those who spend their wealth seeking means to the approval of Allah and assuring [reward for] themselves is like a garden on high ground which is hit by a downpour - so it yields its fruits in double. And [even] if it is not hit by a downpour, then a drizzle [is sufficient].",
      "hindiText": "और जो लोग ख़ुदा की ख़ुशनूदी के लिए और अपने दिली एतक़ाद से अपने माल ख़र्च करते हैं उनकी मिसाल उस (हरे भरे) बाग़ की सी है जो किसी टीले या टीकरे पर लगा हो और उस पर ज़ोर शोर से पानी बरसा तो अपने दुगने फल लाया और अगर उस पर बड़े धड़ल्ले का पानी न भी बरसे तो उसके लिये हल्की फुआर (ही काफ़ी) है",
      "urduText": "ان لوگوں کی مثال جو اپنا مال اللہ تعالیٰ کی رضامندی کی طلب میں دل کی خوشی اور یقین کے ساتھ خرچ کرتے ہیں اس باغ جیسی ہے جو اونچی زمین پر ہواور زوردار بارش اس پر برسے اور وه اپنا پھل دگنا ﻻوے اور اگر اس پر بارش نہ بھی برسے تو پھوار ہی کافی ہے",
      "phraseType": "anonymous",
      "references": [
        {
          "surahNumber": 2,
          "ayahNumber": 265
        }
      ]
    },
    {
      "arabicText": "يا أَيُّهَا الَّذينَ آمَنوا أَنفِقوا مِن طَيِّباتِ ما كَسَبتُم وَمِمّا أَخرَجنا لَكُم مِنَ الأَرضِ ۖ وَلا تَيَمَّمُوا الخَبيثَ مِنهُ تُنفِقونَ وَلَستُم بِآخِذيهِ إِلّا أَن تُغمِضوا فيهِ ۚ",
      "englishText": "O you who have believed, spend from the good things which you have earned and from that which We have produced for you from the earth. And do not aim toward the defective therefrom, spending [from that] while you would not take it [yourself] except with closed eyes.",
      "hindiText": "ऐ ईमान वालों अपनी पाक कमाई और उन चीज़ों में से जो हमने तुम्हारे लिए ज़मीन से पैदा की हैं (ख़ुदा की राह में) ख़र्च करो और बुरे माल को (ख़ुदा की राह में) देने का क़सद भी न करो हालॉकि अगर ऐसा माल कोई तुमको देना चाहे तो तुम अपनी ख़ुशी से उसके लेने वाले नहीं हो मगर ये कि उस (के लेने) में (अमदन) आंख चुराओ",
      "urduText": "اے ایمان والو! اپنی پاکیزه کمائی میں سے اور زمین میں سے تمہارے لئے ہماری نکالی ہوئی چیزوں میں سے خرچ کرو، ان میں سے بری چیزوں کے خرچ کرنے کا قصد نہ کرنا، جسے تم خود لینے والے نہیں ہو، ہاں اگر آنکھیں بند کر لو تو",
      "phraseType": "anonymous",
      "references": [
        {
          "surahNumber": 2,
          "ayahNumber": 267
        }
      ]
    },
    {
      "arabicText": "لِلَّهِ ما فِي السَّماواتِ وَما فِي الأَرضِ ۗ وَإِن تُبدوا ما في أَنفُسِكُم أَو تُخفوهُ يُحاسِبكُم بِهِ اللَّهُ ۖ فَيَغفِرُ لِمَن يَشاءُ وَيُعَذِّبُ مَن يَشاءُ ۗ وَاللَّهُ عَلىٰ كُلِّ شَيءٍ قَديرٌ",
      "englishText": "To Allah belongs whatever is in the heavens and whatever is in the earth. Whether you show what is within yourselves or conceal it, Allah will bring you to account for it. Then He will forgive whom He wills and punish whom He wills, and Allah is over all things competent.",
      "hindiText": "जो कुछ आसमानों में है और जो कुछ ज़मीन में है (ग़रज़) सब कुछ खुदा ही का है और जो कुछ तुम्हारे दिलों में हे ख्वाह तुम उसको ज़ाहिर करो या उसे छिपाओ ख़ुदा तुमसे उसका हिसाब लेगा, फिर जिस को चाहे बख्श दे और जिस पर चाहे अज़ाब करे, और ख़ुदा हर चीज़ पर क़ादिर है",
      "urduText": "آسمانوں اور زمین کی ہر چیز اللہ تعالیٰ ہی کی ملکیت ہے۔ تمہارے دلوں میں جو کچھ ہے اسے تم ﻇاہر کرو یا چھپاؤ، اللہ تعالیٰ اس کا حساب تم سے لے گا۔ پھر جسے چاہے بخشے اور جسے چاہے سزا دے اور اللہ تعالیٰ ہر چیز پر قادر ہے",
      "phraseType": "anonymous",
      "references": [
        {
          "surahNumber": 2,
          "ayahNumber": 284
        }
      ]
    },
    {
      "arabicText": "يَختَصُّ بِرَحمَتِهِ مَن يَشاءُ",
      "englishText": "He selects for His mercy whom He wills.",
      "hindiText": "जिसको चाहे अपनी रहमत के लिये ख़ास कर लेता है",
      "urduText": "وه اپنی رحمت کے ساتھ جسے چاہے مخصوص کر لے",
      "phraseType": "anonymous",
      "references": [
        {
          "surahNumber": 3,
          "ayahNumber": 74
        }
      ]
    }
  ]
}