{
  "timestamp": "2025-11-23T12:53:53.376Z",
  "phraseType": "praise-1",
  "totalPhrases": 21,
  "phrases": [
    {
      "arabicText": "كَيفَ تَكفُرونَ بِاللَّهِ وَكُنتُم أَمواتًا فَأَحياكُم ۖ ثُمَّ يُميتُكُم ثُمَّ يُحييكُم ثُمَّ إِلَيهِ تُرجَعونَ\nهُوَ الَّذي خَلَقَ لَكُم ما فِي الأَرضِ جَميعًا ثُمَّ استَوىٰ إِلَى السَّماءِ فَسَوّاهُنَّ سَبعَ سَماواتٍ ۚ وَهُوَ بِكُلِّ شَيءٍ عَليمٌ",
      "englishText": "How can you disbelieve in Allah when you were lifeless and He brought you to life; then He will cause you to die, then He will bring you [back] to life, and then to Him you will be returned.\nIt is He who created for you all of that which is on the earth. Then He directed Himself to the heaven, [His being above all creation], and made them seven heavens, and He is Knowing of all things.",
      "hindiText": "(हाँए) क्यों कर तुम खुदा का इन्कार कर सकते हो हालाँकि तुम (माओं के पेट में) बेजान थे तो उसी ने तुमको ज़िन्दा किया फिर वही तुमको मार डालेगा, फिर वही तुमको (दोबारा क़यामत में) ज़िन्दा करेगा फिर उसी की तरफ लौटाए जाओगे\nवही तो वह (खुदा) है जिसने तुम्हारे (नफ़े) के ज़मीन की कुल चीज़ों को पैदा किया फिर आसमान (के बनाने) की तरफ़ मुतावज्जेह हुआ तो सात आसमान हमवार (व मुसतहकम) बना दिए और वह (खुदा) हर चीज़ से (खूब) वाक़िफ है",
      "urduText": "تم اللہ کے ساتھ کیسے کفر کرتے ہو؟ حاﻻنکہ تم مرده تھے اس نے تمہیں زنده کیا، پھر تمہیں مار ڈالے گا، پھر زنده کرے گا، پھر اسی کی طرف لوٹائے جاؤ گے\nوه اللہ جس نے تمہارے لئے زمین کی تمام چیزوں کو پیدا کیا، پھر آسمان کی طرف قصد کیا اور ان کو ٹھیک ٹھاک سات آسمان بنایا اور وه ہر چیز کو جانتا ہے",
      "references": [
        {
          "surahNumber": 2,
          "ayahNumber": 28
        },
        {
          "surahNumber": 2,
          "ayahNumber": 29
        }
      ]
    },
    {
      "arabicText": "أَلَم أَقُل لَكُم إِنّي أَعلَمُ غَيبَ السَّماواتِ وَالأَرضِ وَأَعلَمُ ما تُبدونَ وَما كُنتُم تَكتُمونَ",
      "englishText": "Did I not tell you that I know the unseen [aspects] of the heavens and the earth? And I know what you reveal and what you have concealed.",
      "hindiText": "क्यों, मैं तुमसे न कहता था कि मैं आसमानों और ज़मीनों के छिपे हुए राज़ को जानता हूँ, और जो कुछ तुम अब ज़ाहिर करते हो और जो कुछ तुम छिपाते थे (वह सब) जानता हूँ",
      "urduText": "کیا میں نے تمہیں (پہلے ہی) نہ کہا تھا کہ زمین اور آسمانوں کا غیب میں ہی جانتا ہوں اور میرے علم میں ہے جو تم ﻇاہر کر رہے ہو اور جو تم چھپاتے تھے",
      "references": [
        {
          "surahNumber": 2,
          "ayahNumber": 33
        }
      ]
    },
    {
      "arabicText": "إِنَّهُ هُوَ التَّوّابُ الرَّحيمُ",
      "englishText": "Indeed, it is He who is the Accepting of repentance, the Merciful.",
      "hindiText": "बेशक वह बड़ा माफ़ करने वाला मेहरबान है",
      "urduText": "بےشک وہی توبہ قبول کرنے واﻻ اور رحم کرنے واﻻ ہے",
      "references": [
        {
          "surahNumber": 2,
          "ayahNumber": 37
        },
        {
          "surahNumber": 2,
          "ayahNumber": 54
        }
      ]
    },
    {
      "arabicText": "أَلَم تَعلَم أَنَّ اللَّهَ عَلىٰ كُلِّ شَيءٍ قَديرٌ",
      "englishText": "Do you not know that Allah is over all things competent?",
      "hindiText": "क्या तुम नहीं जानते कि बेशुबहा खुदा हर चीज़ पर क़ादिर है",
      "urduText": "کیا تو نہیں جانتا کہ اللہ تعالیٰ ہر چیز پر قادر ہے",
      "references": [
        {
          "surahNumber": 2,
          "ayahNumber": 106
        }
      ]
    },
    {
      "arabicText": "أَلَم تَعلَم أَنَّ اللَّهَ لَهُ مُلكُ السَّماواتِ وَالأَرضِ ۗ وَما لَكُم مِن دونِ اللَّهِ مِن وَلِيٍّ وَلا نَصيرٍ",
      "englishText": "Do you not know that to Allah belongs the dominion of the heavens and the earth and [that] you have not besides Allah any protector or any helper?",
      "hindiText": "क्या तुम नहीं जानते कि आसमान की सलतनत बेशुबहा ख़ास खुदा ही के लिए है और खुदा के सिवा तुम्हारा न कोई सरपरस्त है न मददगार",
      "urduText": "کیا تجھے علم نہیں کہ زمین و آسمان کا ملک اللہ ہی کے لئے ہے اور اللہ کے سوا تمہارا کوئی ولی اور مددگار نہیں",
      "references": [
        {
          "surahNumber": 2,
          "ayahNumber": 107
        }
      ]
    },
    {
      "arabicText": "إِنَّ اللَّهَ بِما تَعمَلونَ بَصيرٌ",
      "englishText": "Indeed, Allah of what you do, is Seeing.",
      "hindiText": "जो कुछ तुम करते हो उसे खुदा ज़रूर देख रहा है",
      "urduText": "بےشک اللہ تعالیٰ تمہارے اعمال کو خوب دیکھ رہا ہے",
      "references": [
        {
          "surahNumber": 2,
          "ayahNumber": 110
        },
        {
          "surahNumber": 2,
          "ayahNumber": 237
        }
      ]
    },
    {
      "arabicText": "وَلِلَّهِ المَشرِقُ وَالمَغرِبُ ۚ فَأَينَما تُوَلّوا فَثَمَّ وَجهُ اللَّهِ ۚ إِنَّ اللَّهَ واسِعٌ عَليمٌ\nوَقالُوا اتَّخَذَ اللَّهُ وَلَدًا ۗ سُبحانَهُ ۖ بَل لَهُ ما فِي السَّماواتِ وَالأَرضِ ۖ كُلٌّ لَهُ قانِتونَ\nبَديعُ السَّماواتِ وَالأَرضِ ۖ وَإِذا قَضىٰ أَمرًا فَإِنَّما يَقولُ لَهُ كُن فَيَكونُ",
      "englishText": "And to Allah belongs the east and the west. So wherever you [might] turn, there is the Face of Allah. Indeed, Allah is all-Encompassing and Knowing.\nThey say, \"Allah has taken a son.\" Exalted is He! Rather, to Him belongs whatever is in the heavens and the earth. All are devoutly obedient to Him,\nOriginator of the heavens and the earth. When He decrees a matter, He only says to it, \"Be,\" and it is.",
      "hindiText": "(तुम्हारे मसजिद में रोकने से क्या होता है क्योंकि सारी ज़मीन) खुदा ही की है (क्या) पूरब (क्या) पश्चिम बस जहाँ कहीं क़िब्ले की तरफ रूख़ करो वही खुदा का सामना है बेशक खुदा बड़ी गुन्जाइश वाला और खूब वाक़िफ है\nऔर यहूद कहने लगे कि खुदा औलाद रखता है हालाँकि वह (इस बखेड़े से) पाक है बल्कि जो कुछ ज़मीन व आसमान में है सब उसी का है और सब उसकी के फरमाबरदार हैं\n(वही) आसमान व ज़मीन का मोजिद है और जब किसी काम का करना ठान लेता है तो उसकी निसबत सिर्फ कह देता है कि ''हो जा'' पस वह (खुद ब खुद) हो जाता है",
      "urduText": "اور مشرق اور مغرب کا مالک اللہ ہی ہے۔ تم جدھر بھی منھ کرو ادھر ہی اللہ کا منھ ہے، اللہ تعالیٰ کشادگی اور وسعت واﻻ اور بڑے علم واﻻ ہے\nیہ کہتے ہیں کہ اللہ تعالیٰ کی اوﻻد ہے، (نہیں بلکہ) وه پاک ہے زمین و آسمان کی تمام مخلوق اس کی ملکیت میں ہے اور ہر ایک اس کافرمانبردار ہے\nوه زمین اور آسمانوں کا ابتداءً پیدا کرنے واﻻ ہے، وه جس کام کو کرنا چاہے کہہ دیتا ہے کہ ہوجا، بس وه وہیں ہوجاتا ہے",
      "references": [
        {
          "surahNumber": 2,
          "ayahNumber": 115
        },
        {
          "surahNumber": 2,
          "ayahNumber": 116
        },
        {
          "surahNumber": 2,
          "ayahNumber": 117
        }
      ]
    },
    {
      "arabicText": "وَإِذ يَرفَعُ إِبراهيمُ القَواعِدَ مِنَ البَيتِ وَإِسماعيلُ رَبَّنا تَقَبَّل مِنّا ۖ إِنَّكَ أَنتَ السَّميعُ العَليمُ\nرَبَّنا وَاجعَلنا مُسلِمَينِ لَكَ وَمِن ذُرِّيَّتِنا أُمَّةً مُسلِمَةً لَكَ وَأَرِنا مَناسِكَنا وَتُب عَلَينا ۖ إِنَّكَ أَنتَ التَّوّابُ الرَّحيمُ\nرَبَّنا وَابعَث فيهِم رَسولًا مِنهُم يَتلو عَلَيهِم آياتِكَ وَيُعَلِّمُهُمُ الكِتابَ وَالحِكمَةَ وَيُزَكّيهِم ۚ إِنَّكَ أَنتَ العَزيزُ الحَكيمُ",
      "englishText": "And [mention] when Abraham was raising the foundations of the House and [with him] Ishmael, [saying], \"Our Lord, accept [this] from us. Indeed You are the Hearing, the Knowing.\nOur Lord, and make us Muslims [in submission] to You and from our descendants a Muslim nation [in submission] to You. And show us our rites and accept our repentance. Indeed, You are the Accepting of repentance, the Merciful.\nOur Lord, and send among them a messenger from themselves who will recite to them Your verses and teach them the Book and wisdom and purify them. Indeed, You are the Exalted in Might, the Wise.\"",
      "hindiText": "और (वह वक्त याद दिलाओ) जब इबराहीम व इसमाईल ख़ानाए काबा की बुनियादें बुलन्द कर रहे थे (और दुआ) माँगते जाते थे कि ऐ हमारे परवरदिगार हमारी (ये ख़िदमत) कुबूल कर बेशक तू ही (दूआ का) सुनने वाला (और उसका) जानने वाला है\n(और) ऐ हमारे पालने वाले तू हमें अपना फरमाबरदार बन्दा बना हमारी औलाद से एक गिरोह (पैदा कर) जो तेरा फरमाबरदार हो, और हमको हमारे हज की जगहों दिखा दे और हमारी तौबा क़ुबूल कर, बेशक तू ही बड़ा तौबा कुबूल करने वाला मेहरबान है\n(और) ऐ हमारे पालने वाले मक्के वालों में उन्हीं में से एक रसूल को भेज जो उनको तेरी आयतें पढ़कर सुनाए और आसमानी किताब और अक्ल की बातें सिखाए और उन (के नुफ़ूस) के पाकीज़ा कर दें बेशक तू ही ग़ालिब और साहिबे तदबीर है",
      "urduText": "ابراہیم ﴿علیہ السلام﴾ اور اسماعیل ﴿علیہ السلام﴾ کعبہ کی بنیادیں اور دیواریں اٹھاتے جاتے تھے اور کہتے جارہے تھے کہ ہمارے پروردگار! تو ہم سے قبول فرما، تو ہی سننے واﻻ اور جاننے واﻻ ہے\nاے ہمارے رب! ہمیں اپنا فرمانبردار بنا لے اور ہماری اوﻻد میں سے بھی ایک جماعت کو اپنی اطاعت گزار رکھ اور ہمیں اپنی عبادتیں سکھا اور ہماری توبہ قبول فرما، تو توبہ قبول فرمانے واﻻ اور رحم وکرم کرنے واﻻ ہے\nاے ہمارے رب! ان میں انہی میں سے رسول بھیج جو ان کے پاس تیری آیتیں پڑھے، انہیں کتاب وحکمت سکھائے اور انہیں پاک کرے، یقیناً تو غلبہ واﻻ اور حکمت واﻻ ہے",
      "references": [
        {
          "surahNumber": 2,
          "ayahNumber": 127
        },
        {
          "surahNumber": 2,
          "ayahNumber": 128
        },
        {
          "surahNumber": 2,
          "ayahNumber": 129
        }
      ]
    },
    {
      "arabicText": "وَهُوَ السَّميعُ العَليمُ",
      "englishText": "And He is the Hearing, the Knowing.",
      "hindiText": "और वह (सबकी हालत) खूब जानता (और) सुनता है",
      "urduText": "اور وه خوب سننے اور جاننے واﻻ ہے",
      "references": [
        {
          "surahNumber": 2,
          "ayahNumber": 137
        }
      ]
    },
    {
      "arabicText": "وَمَا اللَّهُ بِغافِلٍ عَمّا تَعمَلونَ",
      "englishText": "And Allah is not unaware of what you do.",
      "hindiText": "और जो कुछ तुम करते हो खुदा उससे बेख़बर नहीं",
      "urduText": "اور اللہ تمہارے کاموں سے غافل نہیں",
      "references": [
        {
          "surahNumber": 2,
          "ayahNumber": 140
        }
      ]
    },
    {
      "arabicText": "يَهدي مَن يَشاءُ إِلىٰ صِراطٍ مُستَقيمٍ",
      "englishText": "He guides whom He wills to a straight path.",
      "hindiText": "जिसे चाहता है सीधे रास्ते की तरफ हिदायत करता है",
      "urduText": "وه جسے چاہے سیدھی راه کی ہدایت کردے",
      "references": [
        {
          "surahNumber": 2,
          "ayahNumber": 142
        }
      ]
    },
    {
      "arabicText": "أَينَ ما تَكونوا يَأتِ بِكُمُ اللَّهُ جَميعًا",
      "englishText": "Wherever you may be, Allah will bring you forth [for judgement] all together.",
      "hindiText": "तुम जहाँ कहीं होगे ख़ुदा तुम सबको अपनी तरफ ले आऐगा",
      "urduText": "جہاں کہیں بھی تم ہوگے، اللہ تمہیں لے آئے گا",
      "references": [
        {
          "surahNumber": 2,
          "ayahNumber": 148
        }
      ]
    },
    {
      "arabicText": "وَأَنَا التَّوّابُ الرَّحيمُ",
      "englishText": "And I am the Accepting of repentance, the Merciful.",
      "hindiText": "और मै तो बड़ा तौबा क़ुबूल करने वाला मेहरबान हूँ",
      "urduText": "اور میں توبہ قبول کرنے واﻻ اور رحم وکرم کرنے واﻻ ہوں",
      "references": [
        {
          "surahNumber": 2,
          "ayahNumber": 160
        }
      ]
    },
    {
      "arabicText": "وَإِلٰهُكُم إِلٰهٌ واحِدٌ",
      "englishText": "And your god is one God.",
      "hindiText": "तुम्हारा माबूद तो वही यकता ख़ुदा है",
      "urduText": "تم سب کا معبود ایک ہی معبود ہے",
      "references": [
        {
          "surahNumber": 2,
          "ayahNumber": 163
        }
      ]
    },
    {
      "arabicText": "لا إِلٰهَ إِلّا هُوَ الرَّحمٰنُ الرَّحيمُ",
      "englishText": "There is no deity [worthy of worship] except Him, the Entirely Merciful, the Especially Merciful.",
      "hindiText": "उस के सिवा कोई माबूद नहीं जो बड़ा मेहरबान रहम वाला है",
      "urduText": "اس کے سوا کوئی معبود برحق نہیں وه بہت رحم کرنے واﻻ اور بڑا مہربان ہے",
      "references": [
        {
          "surahNumber": 2,
          "ayahNumber": 163
        }
      ]
    },
    {
      "arabicText": "وَاللَّهُ يَعلَمُ وَأَنتُم لا تَعلَمونَ",
      "englishText": "And Allah Knows, while you know not.",
      "hindiText": "और ख़ुदा (तो) जानता ही है मगर तुम नही जानते हो",
      "urduText": "حقیقی علم اللہ ہی کو ہے، تم محض بےخبر ہو",
      "references": [
        {
          "surahNumber": 2,
          "ayahNumber": 216
        },
        {
          "surahNumber": 2,
          "ayahNumber": 232
        }
      ]
    },
    {
      "arabicText": "وَاتَّقُوا اللَّهَ وَاعلَموا أَنَّ اللَّهَ بِكُلِّ شَيءٍ عَليمٌ",
      "englishText": "And fear Allah and know that Allah is Knowing of all things.",
      "hindiText": "और ख़ुदा से डरते रहो और समझ रखो कि ख़ुदा हर चीज़ को ज़रुर जानता है",
      "urduText": "اور اللہ تعالیٰ سے ڈرتے رہا کرو اور جان رکھو کہ اللہ تعالیٰ ہر چیز کو جانتا ہے",
      "references": [
        {
          "surahNumber": 2,
          "ayahNumber": 231
        }
      ]
    },
    {
      "arabicText": "أَنَّ اللَّهَ بِما تَعمَلونَ بَصيرٌ",
      "englishText": "And know that Allah is Seeing of what you do.",
      "hindiText": "और जान रखो कि जो कुछ तुम करते हो ख़ुदा ज़रुर देखता है",
      "urduText": "اور جانتے رہو کہ اللہ تعالیٰ تمہارے اعمال کی دیکھ بھال کر رہا ہے",
      "references": [
        {
          "surahNumber": 2,
          "ayahNumber": 233
        }
      ]
    },
    {
      "arabicText": "وَاللَّهُ بِما تَعمَلونَ خَبيرٌ",
      "englishText": "And Allah is [fully] Acquainted with what you do.",
      "hindiText": "और जो कुछ तुम करते हो ख़ुदा उस से ख़बरदार है",
      "urduText": "اور اللہ تعالیٰ تمہارے ہر عمل سے خبردار ہے",
      "references": [
        {
          "surahNumber": 2,
          "ayahNumber": 234
        }
      ]
    },
    {
      "arabicText": "وَاللَّهُ بِما تَعمَلونَ بَصيرٌ",
      "englishText": "And Allah, of what you do, is Seeing.",
      "hindiText": "और जो कुछ तुम करते हो ख़ुदा उसकी देखभाल करता रहता है",
      "urduText": "اور اللہ تمہارے کام دیکھ رہا ہے",
      "references": [
        {
          "surahNumber": 2,
          "ayahNumber": 265
        },
        {
          "surahNumber": 3,
          "ayahNumber": 156
        }
      ]
    },
    {
      "arabicText": "وَاللَّهُ بِما تَعمَلونَ عَليمٌ",
      "englishText": "And Allah is Knowing of what you do.",
      "hindiText": "और तुम लोग जो कुछ करते हो ख़ुदा उसको ख़ूब जानता है",
      "urduText": "اور جو کچھ تم کرتے ہو اسے اللہ تعالیٰ خوب جانتا ہے",
      "references": [
        {
          "surahNumber": 2,
          "ayahNumber": 283
        }
      ]
    }
  ]
}
