{
  "timestamp": "2026-01-09T17:44:56.063Z",
  "phraseType": "prayer",
  "totalPhrases": 66,
  "phrases": [
    {
      "arabicText": "اهدِنَا الصِّراطَ المُستَقيمَ\nصِراطَ الَّذينَ أَنعَمتَ عَلَيهِم غَيرِ المَغضوبِ عَلَيهِم وَلَا الضّالّينَ",
      "englishText": "Guide us to the straight path\nThe path of those upon whom You have bestowed favor, not of those who have evoked [Your] anger or of those who are astray.",
      "hindiText": "हमें सीधा रास्ता दिखा।\nउन लोगों का रास्ता जिन पर तूने इनाम फ़रमाया, जो माअतूब नहीं हुए, जो भटके हुए नहीं है।",
      "urduText": "ہمیں سیدھی (اور سچی) راه دکھا\nان لوگوں کی راه جن پر تو نے انعام کیا ان کی نہیں جن پر غضب کیا گیا (یعنی وه لوگ جنہوں نے حق کو پہچانا، مگر اس پر عمل پیرا نہیں ہوئے) اور نہ گمراہوں کی (یعنی وه لوگ جو جہالت کے سبب راه حق سے برگشتہ ہوگئے)",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 1,
          "ayahNumber": 6
        },
        {
          "surahNumber": 1,
          "ayahNumber": 7
        }
      ]
    },
    {
      "arabicText": "أَعوذُ بِاللَّهِ أَن أَكونَ مِنَ الجاهِلينَ",
      "englishText": "\"I seek refuge in Allah from being among the ignorant.\"",
      "hindiText": "मैं खुदा से पनाह माँगता हूँ कि मैं जाहिल बनूँ",
      "urduText": "یں ایسا جاہل ہونے سے اللہ تعالیٰ کی پناه پکڑتا ہوں",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 2,
          "ayahNumber": 67
        }
      ]
    },
    {
      "arabicText": "رَبَّنا تَقَبَّل مِنّا ۖ إِنَّكَ أَنتَ السَّميعُ العَليمُ\nرَبَّنا وَاجعَلنا مُسلِمَينِ لَكَ وَمِن ذُرِّيَّتِنا أُمَّةً مُسلِمَةً لَكَ وَأَرِنا مَناسِكَنا وَتُب عَلَينا ۖ إِنَّكَ أَنتَ التَّوّابُ الرَّحيمُ",
      "englishText": "Our Lord, accept [this] from us. Indeed You are the Hearing, the Knowing.\nOur Lord, and make us Muslims [in submission] to You and from our descendants a Muslim nation [in submission] to You. And show us our rites and accept our repentance. Indeed, You are the Accepting of repentance, the Merciful.",
      "hindiText": "ऐ हमारे परवरदिगार हमारी (ये ख़िदमत) कुबूल कर बेशक तू ही (दूआ का) सुनने वाला (और उसका) जानने वाला है\n(और) ऐ हमारे पालने वाले तू हमें अपना फरमाबरदार बन्दा बना हमारी औलाद से एक गिरोह (पैदा कर) जो तेरा फरमाबरदार हो, और हमको हमारे हज की जगहों दिखा दे और हमारी तौबा क़ुबूल कर, बेशक तू ही बड़ा तौबा कुबूल करने वाला मेहरबान है",
      "urduText": "ہمارے پروردگار! تو ہم سے قبول فرما، تو ہی سننے واﻻ اور جاننے واﻻ ہے",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 2,
          "ayahNumber": 127
        },
        {
          "surahNumber": 2,
          "ayahNumber": 128
        }
      ]
    },
    {
      "arabicText": "رَبَّنا آتِنا فِي الدُّنيا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنا عَذابَ النّارِ",
      "englishText": "\"Our Lord, give us in this world [that which is] good and in the Hereafter [that which is] good and protect us from the punishment of the Fire.\"",
      "hindiText": "ऐ मेरे पालने वाले मुझे दुनिया में नेअमत दे और आख़िरत में सवाब दे और दोज़ख़ की बाग से बचा",
      "urduText": "اے ہمارے رب! ہمیں دنیا میں نیکی دے اور آخرت میں بھی بھلائی عطا فرما اور ہمیں عذاب جہنم سے نجات دے",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 2,
          "ayahNumber": 201
        }
      ]
    },
    {
      "arabicText": "رَبَّنا أَفرِغ عَلَينا صَبرًا وَثَبِّت أَقدامَنا وَانصُرنا عَلَى القَومِ الكافِرينَ",
      "englishText": "\"Our Lord, pour upon us patience and plant firmly our feet and give us victory over the disbelieving people.\"",
      "hindiText": "ऐ मेरे परवरदिगार हमें कामिल सब्र अता फरमा और मैदाने जंग में हमारे क़दम जमाए रख और हमें काफिरों पर फतेह इनायत कर",
      "urduText": "اے پروردگار ہمیں صبر دے، ﺛابت قدمی دے اور قوم کفار پر ہماری مدد فرما",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 2,
          "ayahNumber": 250
        }
      ]
    },
    {
      "arabicText": "سَمِعنا وَأَطَعنا ۖ غُفرانَكَ رَبَّنا وَإِلَيكَ المَصيرُ",
      "englishText": "\"We hear and we obey. [We seek] Your forgiveness, our Lord, and to You is the [final] destination.\"",
      "hindiText": "ऐ हमारे परवरदिगार हमने (तेरा इरशाद) सुना",
      "urduText": "ہم نے سنا اور اطاعت کی، ہم تیری بخشش طلب کرتے ہیں اے ہمارے رب! اور ہمیں تیری ہی طرف لوٹنا ہے،",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 2,
          "ayahNumber": 285
        }
      ]
    },
    {
      "arabicText": "رَبَّنا لا تُؤاخِذنا إِن نَسينا أَو أَخطَأنا ۚ رَبَّنا وَلا تَحمِل عَلَينا إِصرًا كَما حَمَلتَهُ عَلَى الَّذينَ مِن قَبلِنا ۚ رَبَّنا وَلا تُحَمِّلنا ما لا طاقَةَ لَنا بِهِ ۖ وَاعفُ عَنّا وَاغفِر لَنا وَارحَمنا ۚ أَنتَ مَولانا فَانصُرنا عَلَى القَومِ الكافِرينَ",
      "englishText": "\"Our Lord, do not impose blame upon us if we have forgotten or erred. Our Lord, and lay not upon us a burden like that which You laid upon those before us. Our Lord, and burden us not with that which we have no ability to bear. And pardon us; and forgive us; and have mercy upon us. You are our protector, so give us victory over the disbelieving people.\"",
      "hindiText": "ऐ हमारे परवरदिगार अगर हम भूल जाऐं या ग़लती करें तो हमारी गिरफ्त न कर ऐ हमारे परवरदिगार हम पर वैसा बोझ न डाल जैसा हमसे अगले लोगों पर बोझा डाला था, और ऐ हमारे परवरदिगार इतना बोझ जिसके उठाने की हमें ताक़त न हो हमसे न उठवा और हमारे कुसूरों से दरगुज़र कर और हमारे गुनाहों को बख्श दे और हम पर रहम फ़रमा तू ही हमारा मालिक है तू ही काफ़िरों के मुक़ाबले में हमारी मदद कर",
      "urduText": "اے ہمارے رب! اگر ہم بھول گئے ہوں یا خطا کی ہو تو ہمیں نہ پکڑنا، اے ہمارے رب! ہم پر وه بوجھ نہ ڈال جو ہم سے پہلے لوگوں پر ڈاﻻ تھا، اے ہمارے رب! ہم پر وه بوجھ نہ ڈال جس کی ہمیں طاقت نہ ہو اور ہم سے درگزر فرما! اور ہمیں بخش دے اور ہم پر رحم کر! تو ہی ہمارا مالک ہے، ہمیں کافروں کی قوم پر غلبہ عطا فرما",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 2,
          "ayahNumber": 286
        }
      ]
    },
    {
      "arabicText": "رَبَّنا لا تُزِغ قُلوبَنا بَعدَ إِذ هَدَيتَنا وَهَب لَنا مِن لَدُنكَ رَحمَةً ۚ إِنَّكَ أَنتَ الوَهّابُ\nرَبَّنا إِنَّكَ جامِعُ النّاسِ لِيَومٍ لا رَيبَ فيهِ ۚ إِنَّ اللَّهَ لا يُخلِفُ الميعادَ",
      "englishText": "[Who say], \"Our Lord, let not our hearts deviate after You have guided us and grant us from Yourself mercy. Indeed, You are the Bestower.\nOur Lord, surely You will gather the people for a Day about which there is no doubt. Indeed, Allah does not fail in His promise.\"",
      "hindiText": "(और दुआ करते हैं) ऐ हमारे पालने वाले हमारे दिल को हिदायत करने के बाद डॉवाडोल न कर और अपनी बारगाह से हमें रहमत अता फ़रमा इसमें तो शक ही नहीं कि तू बड़ा देने वाला है\nऐ हमारे परवरदिगार बेशक तू एक न एक दिन जिसके आने में शुबह नहीं लोगों को इक्ट्ठा करेगा (तो हम पर नज़रे इनायत रहे) बेशक ख़ुदा अपने वायदे के ख़िलाफ़ नहीं करता",
      "urduText": "اے ہمارے رب! ہمیں ہدایت دینے کے بعد ہمارے دل ٹیڑھے نہ کردے اور ہمیں اپنے پاس سے رحمت عطا فرما، یقیناً تو ہی بہت بڑی عطا دینے واﻻ ہے\nاے ہمارے رب! تو یقیناً لوگوں کوایک دن جمع کرنے واﻻ ہے جس کے آنے میں کوئی شک نہیں، یقیناً اللہ تعالیٰ وعده خلافی نہیں کرتا",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 3,
          "ayahNumber": 8
        },
        {
          "surahNumber": 3,
          "ayahNumber": 9
        }
      ]
    },
    {
      "arabicText": "رَبَّنا إِنَّنا آمَنّا فَاغفِر لَنا ذُنوبَنا وَقِنا عَذابَ النّارِ",
      "englishText": "\"Our Lord, indeed we have believed, so forgive us our sins and protect us from the punishment of the Fire,\"",
      "hindiText": "हमारे पालने वाले हम तो (बेताम्मुल) ईमान लाए हैं पस तू भी हमारे गुनाहों को बख्श दे और हमको दोज़ख़ के अज़ाब से बचा",
      "urduText": "ے ہمارے رب! ہم ایمان ﻻ چکے اس لئے ہمارے گناه معاف فرما اور ہمیں آگ کے عذاب سے بچا",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 3,
          "ayahNumber": 16
        }
      ]
    },
    {
      "arabicText": "اللَّهُمَّ مالِكَ المُلكِ تُؤتِي المُلكَ مَن تَشاءُ وَتَنزِعُ المُلكَ مِمَّن تَشاءُ وَتُعِزُّ مَن تَشاءُ وَتُذِلُّ مَن تَشاءُ ۖ بِيَدِكَ الخَيرُ ۖ إِنَّكَ عَلىٰ كُلِّ شَيءٍ قَديرٌ\nتولِجُ اللَّيلَ فِي النَّهارِ وَتولِجُ النَّهارَ فِي اللَّيلِ ۖ وَتُخرِجُ الحَيَّ مِنَ المَيِّتِ وَتُخرِجُ المَيِّتَ مِنَ الحَيِّ ۖ وَتَرزُقُ مَن تَشاءُ بِغَيرِ حِسابٍ",
      "englishText": "\"O Allah, Owner of Sovereignty, You give sovereignty to whom You will and You take sovereignty away from whom You will. You honor whom You will and You humble whom You will. In Your hand is [all] good. Indeed, You are over all things competent.\nYou cause the night to enter the day, and You cause the day to enter the night; and You bring the living out of the dead, and You bring the dead out of the living. And You give provision to whom You will without account.\"",
      "hindiText": "ऐ ख़ुदा तमाम आलम के मालिक तू ही जिसको चाहे सल्तनत दे और जिससे चाहे सल्तनत छीन ले और तू ही जिसको चाहे इज्ज़त दे और जिसे चाहे ज़िल्लत दे हर तरह की भलाई तेरे ही हाथ में है बेशक तू ही हर चीज़ पर क़ादिर है\nतू ही रात को (बढ़ा के) दिन में दाख़िल कर देता है (तो) रात बढ़ जाती है और तू ही दिन को (बढ़ा के) रात में दाख़िल करता है (तो दिन बढ़ जाता है) तू ही बेजान (अन्डा नुत्फ़ा वगैरह) से जानदार को पैदा करता है और तू ही जानदार से बेजान नुत्फ़ा (वगैरहा) निकालता है और तू ही जिसको चाहता है बेहिसाब रोज़ी देता है",
      "urduText": "اے اللہ! اے تمام جہان کے مالک! تو جسے چاہے بادشاہی دے اور جس سے چاہے سلطنت چھین لے اور تو جسے چاہے عزت دے اورجسے چاہے ذلت دے، تیرے ہی ہاتھ میں سب بھلائیاں ہیں، بے شک تو ہر چیز پر قادر ہے\nتو ہی رات کو دن میں داخل کرتا ہے اور دن کو رات میں لے جاتا ہے، تو ہی بے جان سے جاندار پیدا کرتا ہے اور تو ہی جاندار سے بے جان پیدا کرتا ہے، تو ہی ہے کہ جسے چاہتا ہے بے شمار روزی دیتا ہے",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 3,
          "ayahNumber": 26
        },
        {
          "surahNumber": 3,
          "ayahNumber": 27
        }
      ]
    },
    {
      "arabicText": "رَبِّ هَب لي مِن لَدُنكَ ذُرِّيَّةً طَيِّبَةً ۖ إِنَّكَ سَميعُ الدُّعاءِ",
      "englishText": "\"My Lord, grant me from Yourself a good offspring. Indeed, You are the Hearer of supplication.\"",
      "hindiText": "ऐ मेरे पालने वाले तू मुझको (भी) अपनी बारगाह से पाकीज़ा औलाद अता फ़रमा बेशक तू ही दुआ का सुनने वाला है",
      "urduText": "اے میرے پروردگار! مجھے اپنے پاس سے پاکیزه اوﻻد عطا فرما، بے شک تو دعا کا سننے واﻻ ہے",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 3,
          "ayahNumber": 38
        }
      ]
    },
    {
      "arabicText": "رَبَّنَا اغفِر لَنا ذُنوبَنا وَإِسرافَنا في أَمرِنا وَثَبِّت أَقدامَنا وَانصُرنا عَلَى القَومِ الكافِرينَ",
      "englishText": "\"Our Lord, forgive us our sins and the excess [committed] in our affairs and plant firmly our feet and give us victory over the disbelieving people.\"",
      "hindiText": "ऐ हमारे पालने वाले हमारे गुनाह और अपने कामों में हमारी ज्यादतियॉ माफ़ कर और दुश्मनों के मुक़ाबले में हमको साबित क़दम रख और काफ़िरों के गिरोह पर हमको फ़तेह दे",
      "urduText": "اے پروردگار! ہمارے گناہوں کو بخش دے اور ہم سے ہمارے کاموں میں جو بے جا زیادتی ہوئی ہے اسے بھی معاف فرما اور ہمیں ﺛابت قدمی عطا فرما اور ہمیں کافروں کی قوم پر مدد دے",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 3,
          "ayahNumber": 147
        }
      ]
    },
    {
      "arabicText": "رَبَّنا ما خَلَقتَ هٰذا باطِلًا سُبحانَكَ فَقِنا عَذابَ النّارِ\nرَبَّنا إِنَّكَ مَن تُدخِلِ النّارَ فَقَد أَخزَيتَهُ ۖ وَما لِلظّالِمينَ مِن أَنصارٍ\nرَبَّنا إِنَّنا سَمِعنا مُنادِيًا يُنادي لِلإيمانِ أَن آمِنوا بِرَبِّكُم فَآمَنّا ۚ رَبَّنا فَاغفِر لَنا ذُنوبَنا وَكَفِّر عَنّا سَيِّئَاتِنا وَتَوَفَّنا مَعَ الأَبرارِ\nرَبَّنا وَآتِنا ما وَعَدتَنا عَلىٰ رُسُلِكَ وَلا تُخزِنا يَومَ القِيامَةِ ۗ إِنَّكَ لا تُخلِفُ الميعادَ",
      "englishText": "\"Our Lord, You did not create this aimlessly; exalted are You [above such a thing]; then protect us from the punishment of the Fire.\nOur Lord, indeed whoever You admit to the Fire - You have disgraced him, and for the wrongdoers there are no helpers.\nOur Lord, indeed we have heard a caller calling to faith, [saying], 'Believe in your Lord,' and we have believed. Our Lord, so forgive us our sins and remove from us our misdeeds and cause us to die with the righteous.\nOur Lord, and grant us what You promised us through Your messengers and do not disgrace us on the Day of Resurrection. Indeed, You do not fail in [Your] promise.\"",
      "hindiText": "ख़ुदावन्दा तूने इसको बेकार पैदा नहीं किया तू (फेले अबस से) पाक व पाकीज़ा है बस हमको दोज़क के अज़ाब से बचा\nऐ हमारे पालने वाले जिसको तूने दोज़ख़ में डाला तो यक़ीनन उसे रूसवा कर डाला और जुल्म करने वाले का कोई मददगार नहीं\nऐ हमारे पालने वाले (जब) हमने एक आवाज़ लगाने वाले (पैग़म्बर) को सुना कि वह (ईमान के वास्ते यूं पुकारता था) कि अपने परवरदिगार पर ईमान लाओ तो हम ईमान लाए पस ऐ हमारे पालने वाले हमें हमारे गुनाह बख्श दे और हमारी बुराईयों को हमसे दूर करे दे और हमें नेकों के साथ (दुनिया से) उठा ले\nऔर ऐ पालने वाले अपने रसूलों की मार्फत जो कुछ हमसे वायदा किया है हमें दे और हमें क़यामत के दिन रूसवा न कर तू तो वायदा ख़िलाफ़ी करता ही नहीं",
      "urduText": "اے ہمارے پروردگار! تو نے یہ بے فائده نہیں بنایا، تو پاک ہے پس ہمیں آگ کے عذاب سے بچا لے\nاے ہمارے پالنے والے! تو جسے جہنم میں ڈالے یقیناً تو نے اسے رسوا کیا، اور ﻇالموں کا مددگار کوئی نہیں\nاے ہمارے رب! ہم نے سنا کہ منادی کرنے واﻻ بآواز بلند ایمان کی طرف بلا رہا ہے کہ لوگو! اپنے رب پر ایمان لاؤ، پس ہم ایمان ﻻئے۔ یا الٰہی اب تو ہمارے گناه معاف فرما اور ہماری برائیاں ہم سے دور کر دے اور ہماری موت نیکوں کے ساتھ کر\nاے ہمارے پالنے والے معبود! ہمیں وه دے جس کا وعده تو نے ہم سے اپنے رسولوں کی زبانی کیا ہے اور ہمیں قیامت کے دن رسوا نہ کر، یقیناً تو وعده خلافی نہیں کرتا",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 3,
          "ayahNumber": 191
        },
        {
          "surahNumber": 3,
          "ayahNumber": 192
        },
        {
          "surahNumber": 3,
          "ayahNumber": 193
        },
        {
          "surahNumber": 3,
          "ayahNumber": 194
        }
      ]
    },
    {
      "arabicText": "رَبَّنا أَخرِجنا مِن هٰذِهِ القَريَةِ الظّالِمِ أَهلُها وَاجعَل لَنا مِن لَدُنكَ وَلِيًّا وَاجعَل لَنا مِن لَدُنكَ نَصيرًا",
      "englishText": "\"Our Lord, take us out of this city of oppressive people and appoint for us from Yourself a protector and appoint for us from Yourself a helper?\"",
      "hindiText": "ऐ हमारे पालने वाले किसी तरह इस बस्ती (मक्का) से जिसके बाशिन्दे बड़े ज़ालिम हैं हमें निकाल और अपनी तरफ़ से किसी को हमारा सरपरस्त बना और तू ख़ुद ही किसी को अपनी तरफ़ से हमारा मददगार बना",
      "urduText": "اے ہمارے پروردگار! ان ﻇالموں کی بستی سے ہمیں نجات دے اور ہمارے لئے خود اپنے پاس سے حمایتی مقرر کر دے اور ہمارے لئے خاص اپنے پاس سے مددگار بنا",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 4,
          "ayahNumber": 75
        }
      ]
    },
    {
      "arabicText": "وَارزُقنا وَأَنتَ خَيرُ الرّازِقينَ",
      "englishText": "And provide for us, and You are the best of providers.",
      "hindiText": "और तू हमें रोज़ी दे और तू सब रोज़ी देने वालो से बेहतर है",
      "urduText": "ہم کو رزق عطا فرمادے اور تو سب عطا کرنے والوں سے اچھا ہے",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 5,
          "ayahNumber": 114
        }
      ]
    },
    {
      "arabicText": "رَبَّنا ظَلَمنا أَنفُسَنا وَإِن لَم تَغفِر لَنا وَتَرحَمنا لَنَكونَنَّ مِنَ الخاسِرينَ",
      "englishText": "\"Our Lord, we have wronged ourselves, and if You do not forgive us and have mercy upon us, we will surely be among the losers.\"",
      "hindiText": "ऐ हमारे पालने वाले हमने अपना आप नुकसान किया और अगर तू हमें माफ न फरमाएगा और हम पर रहम न करेगा तो हम बिल्कुल घाटे में ही रहेगें",
      "urduText": "اے ہمارے رب! ہم نے اپنا بڑا نقصان کیا اور اگر تو ہماری مغفرت نہ کرے گا اور ہم پر رحم نہ کرے گا تو واقعی ہم نقصان پانے والوں میں سے ہوجائیں گے",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 7,
          "ayahNumber": 23
        }
      ]
    },
    {
      "arabicText": "رَبَّنا لا تَجعَلنا مَعَ القَومِ الظّالِمينَ",
      "englishText": "\"Our Lord, do not place us with the wrongdoing people.\"",
      "hindiText": "ऐ हमारे परवरदिगार हमें ज़ालिम लोगों का साथी न बनाना",
      "urduText": "اے ہمارے رب! ہم کو ان ﻇالم لوگوں کے ساتھ شامل نہ کر",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 7,
          "ayahNumber": 47
        }
      ]
    },
    {
      "arabicText": "رَبَّنا أَفرِغ عَلَينا صَبرًا وَتَوَفَّنا مُسلِمينَ",
      "englishText": "Our Lord, pour upon us patience and let us die as Muslims [in submission to You].",
      "hindiText": "ऐ हमारे परवरदिगार हम पर सब्र (का मेंह बरसा)",
      "urduText": "اے ہمارے رب! ہمارے اوپر صبر کا فیضان فرما اور ہماری جان حالت اسلام پر نکال",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 7,
          "ayahNumber": 126
        }
      ]
    },
    {
      "arabicText": "لَئِن لَم يَرحَمنا رَبُّنا وَيَغفِر لَنا لَنَكونَنَّ مِنَ الخاسِرينَ",
      "englishText": "\"If our Lord does not have mercy upon us and forgive us, we will surely be among the losers.\"",
      "hindiText": "अगर हमारा परदिगार हम पर रहम नहीं करेगा और हमारा कुसूर न माफ़ करेगा तो हम यक़ीनी घाटा उठाने वालों में हो जाएगें",
      "urduText": "اگر ہمارا رب ہم پر رحم نہ کرے اور ہمارا گناه معاف نہ کرے تو ہم بالکل گئے گزرے ہو جائیں گے",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 7,
          "ayahNumber": 149
        }
      ]
    },
    {
      "arabicText": "رَبِّ اغفِر لي وَلِأَخي وَأَدخِلنا في رَحمَتِكَ ۖ وَأَنتَ أَرحَمُ الرّاحِمينَ",
      "englishText": "\"My Lord, forgive me and my brother and admit us into Your mercy, for You are the most merciful of the merciful.\"",
      "hindiText": "ऐ मेरे परवरदिगार मुझे और मेरे भाई को बख्श दे और हमें अपनी रहमत में दाख़िल कर और तू सबसे बढ़के रहम करने वाला है",
      "urduText": "اے میرے رب! میری خطا معاف فرما اور میرے بھائی کی بھی اور ہم دونوں کو اپنی رحمت میں داخل فرما اور تو سب رحم کرنے والوں سے زیاده رحم کرنے واﻻ ہے",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 7,
          "ayahNumber": 151
        }
      ]
    },
    {
      "arabicText": "رَبِّ لَو شِئتَ أَهلَكتَهُم مِن قَبلُ وَإِيّايَ ۖ أَتُهلِكُنا بِما فَعَلَ السُّفَهاءُ مِنّا ۖ إِن هِيَ إِلّا فِتنَتُكَ تُضِلُّ بِها مَن تَشاءُ وَتَهدي مَن تَشاءُ ۖ أَنتَ وَلِيُّنا فَاغفِر لَنا وَارحَمنا ۖ وَأَنتَ خَيرُ الغافِرينَ\nوَاكتُب لَنا في هٰذِهِ الدُّنيا حَسَنَةً وَفِي الآخِرَةِ إِنّا هُدنا إِلَيكَ",
      "englishText": "\"My Lord, if You had willed, You could have destroyed them before and me [as well]. Would You destroy us for what the foolish among us have done? This is not but Your trial by which You send astray whom You will and guide whom You will. You are our Protector, so forgive us and have mercy upon us; and You are the best of forgivers.\nAnd decree for us in this world [that which is] good and [also] in the Hereafter; indeed, we have turned back to You.\"",
      "hindiText": "परवरदिगार अगर तू चाहता तो मुझको और उन सबको पहले ही हलाक़ कर डालता क्या हम में से चन्द बेवकूफों की करनी की सज़ा में हमको हलाक़ करता है ये तो सिर्फ तेरी आज़माइश थी तू जिसे चाहे उसे गुमराही में छोड़ दे और जिसको चाहे हिदायत दे तू ही हमारा मालिक है तू ही हमारे कुसूर को माफ कर और हम पर रहम कर और तू तो तमाम बख्शने वालों से कहीें बेहतर है\nऔर तू ही इस दुनिया (फ़ानी) और आख़िरत में हमारे वास्ते भलाई के लिए लिख ले हम तेरी ही तरफ रूझू करते हैं",
      "urduText": "اے میرے پروردگار! اگر تجھ کو یہ منظور ہوتا تو اس سے قبل ہی ان کو اور مجھ کو ہلاک کر دیتا۔ کیا تو ہم میں سے چند بے وقوفوں کی حرکت پر سب کو ہلاک کردے گا؟ یہ واقعہ محض تیری طرف سے ایک امتحان ہے، ایسے امتحانات سے جس کو تو چاہے گمراہی میں ڈال دے اور جس کو چاہے ہدایت پر قائم رکھے۔ تو ہی تو ہمارا کارساز ہے پس ہم پر مغفرت اور رحمت فرما اور تو سب معافی دینے والوں سے زیاده اچھا ہے\nاور ہم لوگوں کے نام دنیا میں بھی نیک حالی لکھ دے اور آخرت میں بھی، ہم تیری طرف رجوع کرتے ہیں",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 7,
          "ayahNumber": 155
        },
        {
          "surahNumber": 7,
          "ayahNumber": 156
        }
      ]
    },
    {
      "arabicText": "لَئِن آتَيتَنا صالِحًا لَنَكونَنَّ مِنَ الشّاكِرينَ",
      "englishText": "\"If You should give us a good [child], we will surely be among the grateful.\"",
      "hindiText": "अगर तो हमें नेक फरज़न्द अता फरमा तो हम ज़रूर तेरे शुक्रगुज़ार होगें",
      "urduText": "اگر تو نے ہم کو صحیح سالم اوﻻد دے دی تو ہم خوب شکر گزاری کریں گے",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 7,
          "ayahNumber": 189
        }
      ]
    },
    {
      "arabicText": "عَلَى اللَّهِ تَوَكَّلنا رَبَّنا لا تَجعَلنا فِتنَةً لِلقَومِ الظّالِمينَ\nوَنَجِّنا بِرَحمَتِكَ مِنَ القَومِ الكافِرينَ",
      "englishText": "\"Upon Allah do we rely. Our Lord, make us not [objects of] trial for the wrongdoing people\nAnd save us by Your mercy from the disbelieving people.\"",
      "hindiText": "ऐ हमारे पालने वाले तू हमें ज़ालिम लोगों का (ज़रिया) इम्तिहान न बना\nऔर अपनी रहमत से हमें इन काफ़िर लोगों (के नीचे) से नजात दे",
      "urduText": "اے ہمارے پروردگار! ہم کو ان ﻇالموں کے لئے فتنہ نہ بنا\nاور ہم کو اپنی رحمت سے ان کافر لوگوں سے نجات دے",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 10,
          "ayahNumber": 85
        },
        {
          "surahNumber": 10,
          "ayahNumber": 86
        }
      ]
    },
    {
      "arabicText": "رَبِّ إِنّي أَعوذُ بِكَ أَن أَسأَلَكَ ما لَيسَ لي بِهِ عِلمٌ ۖ وَإِلّا تَغفِر لي وَتَرحَمني أَكُن مِنَ الخاسِرينَ",
      "englishText": "\"My Lord, I seek refuge in You from asking that of which I have no knowledge. And unless You forgive me and have mercy upon me, I will be among the losers.\"",
      "hindiText": "ऐ मेरे परवरदिगार मै तुझ ही से पनाह मागँता हूँ कि जिस चीज़ का मुझे इल्म न हो मै उसकी दरख्वास्त करुँ और अगर तु मुझे (मेरे कसूर न बख्श देगा और मुझ पर रहम न खाएगा तो मैं सख्त घाटा उठाने वालों में हो जाऊँगा",
      "urduText": "میرے پالنہار میں تیری ہی پناه چاہتا ہوں اس بات سے کہ تجھ سے وه مانگوں جس کا مجھے علم ہی نہ ہو اگر تو مجھے نہ بخشے گا اور تو مجھ پر رحم نہ فرمائے گا، تو میں خساره پانے والوں میں ہو جاؤں گا",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 11,
          "ayahNumber": 47
        }
      ]
    },
    {
      "arabicText": "مَعاذَ اللَّهِ",
      "englishText": "[I seek] the refuge of Allah",
      "hindiText": "माज़अल्लाह",
      "urduText": "اللہ کی پناه!",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 12,
          "ayahNumber": 23
        }
      ]
    },
    {
      "arabicText": "فاطِرَ السَّماواتِ وَالأَرضِ أَنتَ وَلِيّي فِي الدُّنيا وَالآخِرَةِ ۖ تَوَفَّني مُسلِمًا وَأَلحِقني بِالصّالِحينَ",
      "englishText": "Creator of the heavens and earth, You are my protector in this world and in the Hereafter. Cause me to die a Muslim and join me with the righteous.",
      "hindiText": "ऐ आसमान और ज़मीन के पैदा करने वाले तू ही मेरा मालिक सरपरस्त है दुनिया में भी और आख़िरत में भी तू मुझे (दुनिया से) मुसलमान उठाये और मुझे नेको कारों में शामिल फरमा",
      "urduText": "اے آسمان وزمین کے پیدا کرنے والے! تو ہی دنیا وآخرت میں میرا ولی (دوست) اور کارساز ہے، تو مجھے اسلام کی حالت میں فوت کر اور نیکوں میں ملا دے",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 12,
          "ayahNumber": 101
        }
      ]
    },
    {
      "arabicText": "اجنُبني وَبَنِيَّ أَن نَعبُدَ الأَصنامَ",
      "englishText": "Keep me and my sons away from worshipping idols.",
      "hindiText": "मुझे और मेरी औलाद को इस बात को बचा ले कि बुतों की परसतिश करने लगे",
      "urduText": "مجھے اور میری اوﻻد کو بت پرستی سے پناه دے",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 14,
          "ayahNumber": 35
        }
      ]
    },
    {
      "arabicText": "رَبَّنَا اغفِر لي وَلِوالِدَيَّ وَلِلمُؤمِنينَ يَومَ يَقومُ الحِسابُ",
      "englishText": "Our Lord, forgive me and my parents and the believers the Day the account is established.",
      "hindiText": "ऐ हमारे पालने वाले जिस दिन (आमाल का) हिसाब होने लगे मुझको और मेरे माँ बाप को और सारे ईमानदारों को तू बख्श दे",
      "urduText": "اے ہمارے پروردگار! مجھے بخش دے اور میرے ماں باپ کو بھی بخش اور دیگر مومنوں کو بھی بخش جس دن حساب ہونے لگے",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 14,
          "ayahNumber": 41
        }
      ]
    },
    {
      "arabicText": "رَبِّ ارحَمهُما كَما رَبَّياني صَغيرًا",
      "englishText": "\"My Lord, have mercy upon them as they brought me up [when I was] small.\"",
      "hindiText": "मेरे पालने वाले जिस तरह इन दोनों ने मेरे छोटेपन में मेरी मेरी परवरिश की है इसी तरह तू भी इन पर रहम फरमा",
      "urduText": "اے میرے پروردگار! ان پر ویسا ہی رحم کر جیسا انہوں نے میرے بچپن میں میری پرورش کی ہے",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 17,
          "ayahNumber": 24
        }
      ]
    },
    {
      "arabicText": "رَبِّ أَدخِلني مُدخَلَ صِدقٍ وَأَخرِجني مُخرَجَ صِدقٍ وَاجعَل لي مِن لَدُنكَ سُلطانًا نَصيرًا",
      "englishText": "\"My Lord, cause me to enter a sound entrance and to exit a sound exit and grant me from Yourself a supporting authority.\"",
      "hindiText": "ऐ मेरे परवरदिगार मुझे (जहाँ) पहुँचा अच्छी तरह पहुँचा और मुझे (जहाँ से निकाल) तो अच्छी तरह निकाल और मुझे ख़ास अपनी बारगाह से एक हुकूमत अता फरमा जिस से (हर क़िस्म की) मदद पहुँचे",
      "urduText": "اے میرے پروردگار مجھے جہاں لے جا اچھی طرح لے جا اور جہاں سے نکال اچھی طرح نکال اور میرے لئے اپنے پاس سے غلبہ اور امداد مقرر فرما دے",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 17,
          "ayahNumber": 80
        }
      ]
    },
    {
      "arabicText": "رَبَّنا آتِنا مِن لَدُنكَ رَحمَةً وَهَيِّئ لَنا مِن أَمرِنا رَشَدًا",
      "englishText": "\"Our Lord, grant us from Yourself mercy and prepare for us from our affair right guidance.\"",
      "hindiText": "ऐ हमारे परवरदिगार हमें अपनी बारगाह से रहमत अता फरमा-और हमारे वास्ते हमारे काम में कामयाबी इनायत कर",
      "urduText": "اے ہمارے پروردگار! ہمیں اپنے پاس سے رحمت عطا فرما اور ہمارے کام میں ہمارے لئے راه یابی کو آسان کردے",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 18,
          "ayahNumber": 10
        }
      ]
    },
    {
      "arabicText": "عَسىٰ أَن يَهدِيَنِ رَبّي لِأَقرَبَ مِن هٰذا رَشَدًا",
      "englishText": "\"Perhaps my Lord will guide me to what is nearer than this to right conduct.\"",
      "hindiText": "उम्मीद है कि मेरा परवरदिगार मुझे ऐसी बात की हिदायत फरमाए जो रहनुमाई में उससे भी ज्यादा क़रीब हो",
      "urduText": "مجھے پوری امید ہے کہ میرا رب مجھے اس سے بھی زیاده ہدایت کے قریب کی بات کی رہبری کرے",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 18,
          "ayahNumber": 24
        }
      ]
    },
    {
      "arabicText": "رَبِّ إِنّي وَهَنَ العَظمُ مِنّي وَاشتَعَلَ الرَّأسُ شَيبًا وَلَم أَكُن بِدُعائِكَ رَبِّ شَقِيًّا\nوَإِنّي خِفتُ المَوالِيَ مِن وَرائي وَكانَتِ امرَأَتي عاقِرًا فَهَب لي مِن لَدُنكَ وَلِيًّا\nيَرِثُني وَيَرِثُ مِن آلِ يَعقوبَ ۖ وَاجعَلهُ رَبِّ رَضِيًّا",
      "englishText": "\"My Lord, indeed my bones have weakened, and my head has filled with white, and never have I been in my supplication to You, my Lord, unhappy.\nAnd indeed, I fear the successors after me, and my wife has been barren, so give me from Yourself an heir\nWho will inherit me and inherit from the family of Jacob. And make him, my Lord, pleasing [to You].\"",
      "hindiText": "ऐ मेरे पालने वाले मेरी हड्डियां कमज़ोर हो गई और सर है कि बुढ़ापे की (आग से) भड़क उठा (सेफद हो गया) है और ऐ मेरे पालने वाले मैं तेरी बारगाह में दुआ कर के कभी महरूम नहीं रहा हूँ\nऔर मैं अपने (मरने के) बाद अपने वारिसों से सहम जाता हूँ (कि मुबादा दीन को बरबाद करें) और मेरी बीबी उम्मे कुलसूम बिनते इमरान बांझ है पस तू मुझको अपनी बारगाह से एक जाँनशीन फरज़न्द अता फ़रमा\nजो मेरी और याकूब की नस्ल की मीरास का मालिक हो ऐ मेरे परवरदिगार और उसको अपना पसन्दीदा बन्दा बना",
      "urduText": "اے میرے پروردگار! میری ہڈیاں کمزور ہوگئی ہیں اور سر بڑھاپے کی وجہ سے بھڑک اٹھا ہے، لیکن میں کبھی بھی تجھ سے دعا کر کے محروم نہیں رہا\nمجھے اپنے مرنے کے بعد اپنے قرابت والوں کا ڈر ہے، میری بیوی بھی بانجھ ہے پس تو مجھے اپنے پاس سے وارث عطا فرما\nجو میرا بھی وارث ہو اور یعقوب (علیہ السلام) کے خاندان کا بھی جانشین اور میرے رب! تو اسے مقبول بنده بنا لے",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 19,
          "ayahNumber": 4
        },
        {
          "surahNumber": 19,
          "ayahNumber": 5
        },
        {
          "surahNumber": 19,
          "ayahNumber": 6
        }
      ]
    },
    {
      "arabicText": "إِنّي أَعوذُ بِالرَّحمٰنِ مِنكَ إِن كُنتَ تَقِيًّا",
      "englishText": "\"Indeed, I seek refuge in the Most Merciful from you, [so leave me], if you should be fearing of Allah.\"",
      "hindiText": "अगर तू परहेज़गार है तो मैं तुझ से खुदा की पनाह माँगती हूँ",
      "urduText": "میں تجھ سے رحمٰن کی پناه مانگتی ہوں اگر تو کچھ بھی اللہ سے ڈرنے واﻻ ہے",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 19,
          "ayahNumber": 18
        }
      ]
    },
    {
      "arabicText": "رَبِّ زِدني عِلمًا",
      "englishText": "\"My Lord, increase me in knowledge.\"",
      "hindiText": "ऐ मेरे पालने वाले मेरे इल्म को और ज्यादा फ़रमा",
      "urduText": "پروردگار! میرا علم بڑھا",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 20,
          "ayahNumber": 114
        }
      ]
    },
    {
      "arabicText": "رَبَّهُ أَنّي مَسَّنِيَ الضُّرُّ وَأَنتَ أَرحَمُ الرّاحِمينَ",
      "englishText": "\"Indeed, adversity has touched me, and you are the Most Merciful of the merciful.\"",
      "hindiText": "(ख़ुदा वन्द) बीमारी तो मेरे पीछे लग गई है और तू तो सब रहम करने वालोंसे (बढ़ कर है मुझ पर तरस खा)",
      "urduText": "مجھے یہ بیماری لگ گئی ہے اور تو رحم کرنے والوں سے زیاده رحم کرنے واﻻ ہے",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 21,
          "ayahNumber": 83
        }
      ]
    },
    {
      "arabicText": "لا إِلٰهَ إِلّا أَنتَ سُبحانَكَ إِنّي كُنتُ مِنَ الظّالِمينَ",
      "englishText": "\"There is no deity except You; exalted are You. Indeed, I have been of the wrongdoers.\"",
      "hindiText": "(परवरदिगार) तेरे सिवा कोई माबूद नहीं तू (हर ऐब से) पाक व पाकीज़ा है बेशक मैं कुसूरवार हूँ",
      "urduText": "الٰہی تیرے سوا کوئی معبود نہیں تو پاک ہے، بیشک میں ﻇالموں میں ہو گیا",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 21,
          "ayahNumber": 87
        }
      ]
    },
    {
      "arabicText": "رَبِّ لا تَذَرني فَردًا وَأَنتَ خَيرُ الوارِثينَ",
      "englishText": "\"My Lord, do not leave me alone [with no heir], while you are the best of inheritors.\"",
      "hindiText": "ऐ मेरे पालने वाले मुझे तन्हा (बे औलाद) न छोड़ और तू तो सब वारिसों से बेहतर है",
      "urduText": "اے میرے پروردگار! مجھے تنہا نہ چھوڑ، تو سب سے بہتر وارث ہے",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 21,
          "ayahNumber": 89
        }
      ]
    },
    {
      "arabicText": "رَبِّ انصُرني بِما كَذَّبونِ",
      "englishText": "\"My Lord, support me because they have denied me.\"",
      "hindiText": "तू मेरी मदद कर",
      "urduText": "پروردگار! ان کے جھٹلانے پر تو میری مدد کر",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 23,
          "ayahNumber": 39
        }
      ]
    },
    {
      "arabicText": "رَبِّ أَعوذُ بِكَ مِن هَمَزاتِ الشَّياطينِ\nوَأَعوذُ بِكَ رَبِّ أَن يَحضُرونِ",
      "englishText": "\"My Lord, I seek refuge in You from the incitements of the devils,\nAnd I seek refuge in You, my Lord, lest they be present with me.\"",
      "hindiText": "ऐ मेरे पालने वाले मै शैतान के वसवसों से तेरी पनाह माँगता हूँ\nऔर ऐ मेरे परवरदिगार इससे भी तेरी पनाह माँगता हूँ कि शयातीन मेरे पास आएँ",
      "urduText": "اے میرے پروردگار! میں شیطانوں کے وسوسوں سے تیری پناه چاہتا ہوں\nاور اے رب! میں تیری پناه چاہتا ہوں کہ وه میرے پاس آجائیں",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 23,
          "ayahNumber": 97
        },
        {
          "surahNumber": 23,
          "ayahNumber": 98
        }
      ]
    },
    {
      "arabicText": "رَبَّنا آمَنّا فَاغفِر لَنا وَارحَمنا وَأَنتَ خَيرُ الرّاحِمينَ",
      "englishText": "'Our Lord, we have believed, so forgive us and have mercy upon us, and You are the best of the merciful.'",
      "hindiText": "ऐ हमारे पालने वाले हम ईमान लाए तो तू हमको बख्श दे और हम पर रहम कर तू तो तमाम रहम करने वालों से बेहतर है",
      "urduText": "اے ہمارے پروردگار! ہم ایمان ﻻچکے ہیں تو ہمیں بخش اور ہم پر رحم فرما تو سب مہربانوں سے زیاده مہربان ہے",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 23,
          "ayahNumber": 109
        }
      ]
    },
    {
      "arabicText": "رَبِّ اغفِر وَارحَم وَأَنتَ خَيرُ الرّاحِمينَ",
      "englishText": "\"My Lord, forgive and have mercy, and You are the best of the merciful.\"",
      "hindiText": "परवरदिगार तू (मेरी उम्मत को) बख्श दे और तरस खा और तू तो सब रहम करने वालों से बेहतर है",
      "urduText": "اے میرے رب! تو بخش اور رحم کر اور تو سب مہربانوں سے بہتر مہربانی کرنے واﻻ ہے",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 23,
          "ayahNumber": 118
        }
      ]
    },
    {
      "arabicText": "رَبَّنَا اصرِف عَنّا عَذابَ جَهَنَّمَ ۖ إِنَّ عَذابَها كانَ غَرامًا\nإِنَّها ساءَت مُستَقَرًّا وَمُقامًا",
      "englishText": "\"Our Lord, avert from us the punishment of Hell. Indeed, its punishment is ever adhering;\nIndeed, it is evil as a settlement and residence.\"",
      "hindiText": "परवरदिगारा हम से जहन्नुम का अज़ाब फेरे रहना क्योंकि उसका अज़ाब बहुत (सख्त और पाएदार होगा)\nबेशक वह बहुत बुरा ठिकाना और बुरा मक़ाम है",
      "urduText": "اے ہمارے پروردگار! ہم سے دوزخ کا عذاب پرے ہی پرے رکھ، کیونکہ اس کا عذاب چمٹ جانے واﻻ ہے\nبے شک وه ٹھہرنے اور رہنے کے لحاظ سے بدترین جگہ ہے",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 25,
          "ayahNumber": 65
        },
        {
          "surahNumber": 25,
          "ayahNumber": 66
        }
      ]
    },
    {
      "arabicText": "رَبَّنا هَب لَنا مِن أَزواجِنا وَذُرِّيّاتِنا قُرَّةَ أَعيُنٍ وَاجعَلنا لِلمُتَّقينَ إِمامًا",
      "englishText": "\"Our Lord, grant us from among our wives and offspring comfort to our eyes and make us an example for the righteous.\"",
      "hindiText": "परवरदिगार हमें हमारी बीबियों और औलादों की तरफ से ऑंखों की ठन्डक अता फरमा और हमको परहेज़गारों का पेशवा बना",
      "urduText": "اے ہمارے پروردگار! تو ہمیں ہماری بیویوں اور اوﻻد سے آنکھوں کی ٹھنڈک عطا فرما اور ہمیں پرہیزگاروں کا پیشوا بنا",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 25,
          "ayahNumber": 74
        }
      ]
    },
    {
      "arabicText": "رَبِّ هَب لي حُكمًا وَأَلحِقني بِالصّالِحينَ\nوَاجعَل لي لِسانَ صِدقٍ فِي الآخِرينَ\nوَاجعَلني مِن وَرَثَةِ جَنَّةِ النَّعيمِ\nوَاغفِر لِأَبي إِنَّهُ كانَ مِنَ الضّالّينَ\nوَلا تُخزِني يَومَ يُبعَثونَ\nيَومَ لا يَنفَعُ مالٌ وَلا بَنونَ\nإِلّا مَن أَتَى اللَّهَ بِقَلبٍ سَليمٍ",
      "englishText": "\"My Lord, grant me authority and join me with the righteous.\nAnd grant me a reputation of honor among later generations.\nAnd place me among the inheritors of the Garden of Pleasure.\nAnd forgive my father. Indeed, he has been of those astray.\nAnd do not disgrace me on the Day they are [all] resurrected -\nThe Day when there will not benefit [anyone] wealth or children\nBut only one who comes to Allah with a sound heart.\"",
      "hindiText": "परवरदिगार मुझे इल्म व फहम अता फरमा और मुझे नेकों के साथ शामिल कर\nऔर आइन्दा आने वाली नस्लों में मेरा ज़िक्रे ख़ैर क़ायम रख\nऔर मुझे भी नेअमत के बाग़ (बेहश्त) के वारिसों में से बना\nऔर मेरे (मुँह बोले) बाप (चचा आज़र) को बख्श दे क्योंकि वह गुमराहों में से है\nऔर जिस दिन लोग क़ब्रों से उठाए जाएँगें मुझे रुसवा न करना\nजिस दिन न तो माल ही कुछ काम आएगा और न लड़के बाले\nमगर जो शख्स ख़ुदा के सामने (गुनाहों से) पाक दिल लिए हुए हाज़िर होगा (वह फायदे में रहेगा)",
      "urduText": "اے میرے رب! مجھے قوت فیصلہ عطا فرما اور مجھے نیک لوگوں میں ملا دے\nاور میرا ذکر خیر پچھلے لوگوں میں بھی باقی رکھ\nمجھے نعمتوں والی جنت کے وارﺛوں میں سے بنادے\nاور میرے باپ کو بخش دے یقیناً وه گمراہوں میں سے تھا\nاور جس دن کے لوگ دوباره جلائے جائیں مجھے رسوا نہ کر\nجس دن کہ مال اور اوﻻد کچھ کام نہ آئے گی\nلیکن فائده واﻻ وہی ہوگا جو اللہ تعالیٰ کے سامنے بے عیب دل لے کر جائے",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 26,
          "ayahNumber": 83
        },
        {
          "surahNumber": 26,
          "ayahNumber": 84
        },
        {
          "surahNumber": 26,
          "ayahNumber": 85
        },
        {
          "surahNumber": 26,
          "ayahNumber": 86
        },
        {
          "surahNumber": 26,
          "ayahNumber": 87
        },
        {
          "surahNumber": 26,
          "ayahNumber": 88
        },
        {
          "surahNumber": 26,
          "ayahNumber": 89
        }
      ]
    },
    {
      "arabicText": "رَبِّ نَجِّني وَأَهلي مِمّا يَعمَلونَ",
      "englishText": "My Lord, save me and my family from [the consequence of] what they do.\"",
      "hindiText": "(और दुआ की) परवरदिगार जो कुछ ये लोग करते है उससे मुझे और मेरे लड़कों को नजात दे",
      "urduText": "میرے پروردگار! مجھے اور میرے گھرانے کو اس (وبال) سے بچالے جو یہ کرتے ہیں",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 26,
          "ayahNumber": 169
        }
      ]
    },
    {
      "arabicText": "رَبِّ أَوزِعني أَن أَشكُرَ نِعمَتَكَ الَّتي أَنعَمتَ عَلَيَّ وَعَلىٰ والِدَيَّ وَأَن أَعمَلَ صالِحًا تَرضاهُ وَأَدخِلني بِرَحمَتِكَ في عِبادِكَ الصّالِحينَ",
      "englishText": "\"My Lord, enable me to be grateful for Your favor which You have bestowed upon me and upon my parents and to do righteousness of which You approve. And admit me by Your mercy into [the ranks of] Your righteous servants.\"",
      "hindiText": "परवरदिगार मुझे तौफीक़ अता फरमा कि जैसी जैसी नेअमतें तूने मुझ पर और मेरे वालदैन पर नाज़िल फरमाई हैं मै (उनका) शुक्रिया अदा करुँ और मैं ऐसे नेक काम करुँ जिसे तू पसन्द फरमाए और तू अपनी ख़ास मेहरबानी से मुझे (अपने) नेकोकार बन्दों में दाखिल कर",
      "urduText": "اے پروردگار! تو مجھے توفیق دے کہ میں تیری ان نعمتوں کا شکر بجا ﻻؤں جو تو نے مجھ پر انعام کی ہیں اور میرے ماں باپ پر اور میں ایسے نیک اعمال کرتا رہوں جن سے تو خوش رہے مجھے اپنی رحمت سے نیک بندوں میں شامل کر لے",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 27,
          "ayahNumber": 19
        }
      ]
    },
    {
      "arabicText": "الحَمدُ لِلَّهِ وَسَلامٌ عَلىٰ عِبادِهِ الَّذينَ اصطَفىٰ",
      "englishText": "Praise be to Allah, and peace upon His servants whom He has chosen",
      "hindiText": "खुदा का शुक्र और उसके बरगुज़ीदा बन्दों पर सलाम",
      "urduText": "تمام تعریف اللہ ہی کے لیے ہے اور اس کے برگزیده بندوں پر سلام ہے",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 27,
          "ayahNumber": 59
        }
      ]
    },
    {
      "arabicText": "رَبِّ إِنّي ظَلَمتُ نَفسي فَاغفِر لي",
      "englishText": "\"My Lord, indeed I have wronged myself, so forgive me,\"",
      "hindiText": "परवरदिगार बेशक मैने अपने ऊपर आप ज़ुल्म किया (कि इस शहर में आया) तो तू मुझे (दुश्मनों से) पोशीदा रख",
      "urduText": "اے پروردگار! میں نے خود اپنے اوپر ﻇلم کیا، تو مجھے معاف فرما دے",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 28,
          "ayahNumber": 16
        }
      ]
    },
    {
      "arabicText": "رَبِّ نَجِّني مِنَ القَومِ الظّالِمينَ",
      "englishText": "\"My Lord, save me from the wrongdoing people.\"",
      "hindiText": "परवरदिगार मुझे ज़ालिम लोगों (के हाथ) से नजात दे",
      "urduText": "اے پروردگار! مجھے ﻇالموں کے گروه سے بچا لے",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 28,
          "ayahNumber": 21
        }
      ]
    },
    {
      "arabicText": "عَسىٰ رَبّي أَن يَهدِيَني سَواءَ السَّبيلِ",
      "englishText": "\"Perhaps my Lord will guide me to the sound way.\"",
      "hindiText": "मुझे उम्मीद है कि मेरा परवरदिगार मुझे सीधे रास्ता दिखा दे",
      "urduText": "مجھے امید ہے کہ میرا رب مجھے سیدھی راه لے چلے گا",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 28,
          "ayahNumber": 22
        }
      ]
    },
    {
      "arabicText": "إِنّي لِما أَنزَلتَ إِلَيَّ مِن خَيرٍ فَقيرٌ",
      "englishText": "\"My Lord, indeed I am, for whatever good You would send down to me, in need.\"",
      "hindiText": "परवरदिगार (उस वक्त) ज़ो नेअमत तू मेरे पास भेज दे मै उसका सख्त हाजत मन्द हूँ",
      "urduText": "اے پروردگار! تو جو کچھ بھلائی میری طرف اتارے میں اس کا محتاج ہوں",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 28,
          "ayahNumber": 24
        }
      ]
    },
    {
      "arabicText": "رَبِّ انصُرني عَلَى القَومِ المُفسِدينَ",
      "englishText": "\"My Lord, support me against the corrupting people.\"",
      "hindiText": "परवरदिगार इन मुफ़सिद लोगों के मुक़ाबले में मेरी मदद कर",
      "urduText": "پروردگار! اس مفسد قوم پر میری مدد فرما",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 29,
          "ayahNumber": 30
        }
      ]
    },
    {
      "arabicText": "رَبِّ هَب لي مِنَ الصّالِحينَ",
      "englishText": "My Lord, grant me [a child] from among the righteous.",
      "hindiText": "परवरदिगार मुझे एक नेको कार (फरज़न्द) इनायत फरमा",
      "urduText": "اے میرے رب! مجھے نیک بخت اوﻻد عطا فرما",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 37,
          "ayahNumber": 100
        }
      ]
    },
    {
      "arabicText": "رَبِّ اغفِر لي وَهَب لي مُلكًا لا يَنبَغي لِأَحَدٍ مِن بَعدي ۖ إِنَّكَ أَنتَ الوَهّابُ",
      "englishText": "\"My Lord, forgive me and grant me a kingdom such as will not belong to anyone after me. Indeed, You are the Bestower.\"",
      "hindiText": "परवरदिगार मुझे बख्श दे और मुझे वह मुल्क अता फरमा जो मेरे बाद किसी के वास्ते शायाँह न हो इसमें तो शक नहीं कि तू बड़ा बख्शने वाला है",
      "urduText": "اے میرے رب! مجھے بخش دے اور مجھے ایسا ملک عطا فرما جو میرے سوا کسی (شخص) کے ﻻئق نہ ہو، تو بڑا ہی دینے واﻻ ہے",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 38,
          "ayahNumber": 35
        }
      ]
    },
    {
      "arabicText": "رَبَّنا وَسِعتَ كُلَّ شَيءٍ رَحمَةً وَعِلمًا فَاغفِر لِلَّذينَ تابوا وَاتَّبَعوا سَبيلَكَ وَقِهِم عَذابَ الجَحيمِ\nرَبَّنا وَأَدخِلهُم جَنّاتِ عَدنٍ الَّتي وَعَدتَهُم وَمَن صَلَحَ مِن آبائِهِم وَأَزواجِهِم وَذُرِّيّاتِهِم ۚ إِنَّكَ أَنتَ العَزيزُ الحَكيمُ\nوَقِهِمُ السَّيِّئَاتِ ۚ وَمَن تَقِ السَّيِّئَاتِ يَومَئِذٍ فَقَد رَحِمتَهُ ۚ وَذٰلِكَ هُوَ الفَوزُ العَظيمُ",
      "englishText": "\"Our Lord, You have encompassed all things in mercy and knowledge, so forgive those who have repented and followed Your way and protect them from the punishment of Hellfire.\nOur Lord, and admit them to gardens of perpetual residence which You have promised them and whoever was righteous among their fathers, their spouses and their offspring. Indeed, it is You who is the Exalted in Might, the Wise.\nAnd protect them from the evil consequences [of their deeds]. And he whom You protect from evil consequences that Day - You will have given him mercy. And that is the great attainment.\"",
      "hindiText": "परवरदिगार तेरी रहमत और तेरा इल्म हर चीज़ पर अहाता किए हुए हैं, तो जिन लोगों ने (सच्चे) दिल से तौबा कर ली और तेरे रास्ते पर चले उनको बख्श दे और उनको जहन्नुम के अज़ाब से बचा ले\nऐ हमारे पालने वाले इन को सदाबहार बाग़ों में जिनका तूने उन से वायदा किया है दाख़िल कर और उनके बाप दादाओं और उनकी बीवीयों और उनकी औलाद में से जो लोग नेक हो उनको (भी बख्श दें) बेशक तू ही ज़बरदस्त (और) हिकमत वाला है\nऔर उनको हर किस्म की बुराइयों से महफूज़ रख और जिसको तूने उस दिन ( कयामत ) के अज़ाबों से बचा लिया उस पर तूने बड़ा रहम किया और यही तो बड़ी कामयाबी है",
      "urduText": "اے ہمارے پروردگار! تو نے ہر چیز کو اپنی بخشش اور علم سے گھیر رکھا ہے، پس تو انہیں بخش دے جو توبہ کریں اور تیری راه کی پیروی کریں اور تو انہیں دوزخ کے عذاب سے بھی بچا لے\nاے ہمارے رب! تو انہیں ہمیشگی والی جنتوں میں لے جا جن کا تو نے ان سے وعده کیا ہے اور ان کے باپ دادوں اور بیویوں اور اوﻻد میں سے (بھی) ان (سب) کو جو نیک عمل ہیں۔ یقیناً تو تو غالب و باحکمت ہے\nانہیں برائیوں سے بھی محفوظ رکھ، حق تو یہ ہے کہ اس دن تونے جسے برائیوں سے بچا لیا اس پر تو نے رحمت کر دی اور بہت بڑی کامیابی تو یہی ہے",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 40,
          "ayahNumber": 7
        },
        {
          "surahNumber": 40,
          "ayahNumber": 8
        },
        {
          "surahNumber": 40,
          "ayahNumber": 9
        }
      ]
    },
    {
      "arabicText": "رَبِّ أَوزِعني أَن أَشكُرَ نِعمَتَكَ الَّتي أَنعَمتَ عَلَيَّ وَعَلىٰ والِدَيَّ وَأَن أَعمَلَ صالِحًا تَرضاهُ وَأَصلِح لي في ذُرِّيَّتي ۖ إِنّي تُبتُ إِلَيكَ وَإِنّي مِنَ المُسلِمينَ",
      "englishText": "\"My Lord, enable me to be grateful for Your favor which You have bestowed upon me and upon my parents and to work righteousness of which You will approve and make righteous for me my offspring. Indeed, I have repented to You, and indeed, I am of the Muslims.\"",
      "hindiText": "परवरदिगार तो मुझे तौफ़ीक़ अता फरमा कि तूने जो एहसानात मुझ पर और मेरे वालदैन पर किये हैं मैं उन एहसानों का शुक्रिया अदा करूँ और ये (भी तौफीक दे) कि मैं ऐसा नेक काम करूँ जिसे तू पसन्द करे और मेरे लिए मेरी औलाद में सुलाह व तक़वा पैदा करे तेरी तरफ रूजू करता हूँ और मैं यक़ीनन फरमाबरदारो में हूँ",
      "urduText": "اے میرے پروردگار! مجھے توفیق دے کہ میں تیری اس نعمت کا شکر بجا ﻻؤں جو تو نے مجھ پر اور میرے ماں باپ پر انعام کی ہے اور یہ کہ میں ایسے نیک عمل کروں جن سے تو خوش ہو جائے اور تو میری اوﻻد بھی صالح بنا، میں تیری طرف رجوع کرتا ہوں اور میں مسلمانوں میں سے ہوں",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 46,
          "ayahNumber": 15
        }
      ]
    },
    {
      "arabicText": "أَنّي مَغلوبٌ فَانتَصِر",
      "englishText": "\"Indeed, I am overpowered, so help.\"",
      "hindiText": "मैं इनके मुक़ाबले में कमज़ोर हूँ तो अब तू ही (इनसे) बदला ले",
      "urduText": "میں بے بس ہوں تو میری مدد کر",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 54,
          "ayahNumber": 10
        }
      ]
    },
    {
      "arabicText": "رَبَّنَا اغفِر لَنا وَلِإِخوانِنَا الَّذينَ سَبَقونا بِالإيمانِ وَلا تَجعَل في قُلوبِنا غِلًّا لِلَّذينَ آمَنوا رَبَّنا إِنَّكَ رَءوفٌ رَحيمٌ",
      "englishText": "\"Our Lord, forgive us and our brothers who preceded us in faith and put not in our hearts [any] resentment toward those who have believed. Our Lord, indeed You are Kind and Merciful.\"",
      "hindiText": "परवरदिगारा हमारी और उन लोगों की जो हमसे पहले ईमान ला चुके मग़फेरत कर और मोमिनों की तरफ से हमारे दिलों में किसी तरह का कीना न आने दे परवरदिगार बेशक तू बड़ा शफीक़ निहायत रहम वाला है",
      "urduText": "اے ہمارے پروردگار ہمیں بخش دے اور ہمارے ان بھائیوں کو بھی جو ہم سے پہلے ایمان ﻻچکے ہیں اور ایمان داروں کی طرف سے ہمارے دل میں کینہ (اور دشمنی) نہ ڈال، اے ہمارے رب بیشک تو شفقت ومہربانی کرنے واﻻ ہے",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 59,
          "ayahNumber": 10
        }
      ]
    },
    {
      "arabicText": "رَبَّنا عَلَيكَ تَوَكَّلنا وَإِلَيكَ أَنَبنا وَإِلَيكَ المَصيرُ\nرَبَّنا لا تَجعَلنا فِتنَةً لِلَّذينَ كَفَروا وَاغفِر لَنا رَبَّنا ۖ إِنَّكَ أَنتَ العَزيزُ الحَكيمُ",
      "englishText": "Our Lord, upon You we have relied, and to You we have returned, and to You is the destination.\nOur Lord, make us not [objects of] torment for the disbelievers and forgive us, our Lord. Indeed, it is You who is the Exalted in Might, the Wise.\"",
      "hindiText": "ऐ हमारे पालने वाले (ख़ुदा) हमने तुझी पर भरोसा कर लिया है और तेरी ही तरफ हम रूजू करते हैं\nऔर तेरी तरफ हमें लौट कर जाना है ऐ हमारे पालने वाले तू हम लोगों को काफ़िरों की आज़माइश (का ज़रिया) न क़रार दे और परवरदिगार तू हमें बख्श दे बेशक तू ग़ालिब (और) हिकमत वाला है",
      "urduText": "اے ہمارے رب! تو ہمیں کافروں کی آزمائش میں نہ ڈال اور اے ہمارے پالنے والے ہماری خطاؤں کو بخش دے، بیشک تو ہی غالب، حکمت واﻻ ہے",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 60,
          "ayahNumber": 4
        },
        {
          "surahNumber": 60,
          "ayahNumber": 5
        }
      ]
    },
    {
      "arabicText": "رَبَّنا أَتمِم لَنا نورَنا وَاغفِر لَنا ۖ إِنَّكَ عَلىٰ كُلِّ شَيءٍ قَديرٌ",
      "englishText": "\"Our Lord, perfect for us our light and forgive us. Indeed, You are over all things competent.\"",
      "hindiText": "परवरदिगार हमारे लिए हमारा नूर पूरा कर और हमें बख्य दे बेशक तू हर चीज़ पर कादिर है",
      "urduText": "اے ہمارے رب ہمیں کامل نور عطا فرما اور ہمیں بخش دے یقیناً تو ہر چیز پر قادر ہے",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 66,
          "ayahNumber": 8
        }
      ]
    },
    {
      "arabicText": "رَبِّ ابنِ لي عِندَكَ بَيتًا فِي الجَنَّةِ وَنَجِّني مِن فِرعَونَ وَعَمَلِهِ وَنَجِّني مِنَ القَومِ الظّالِمينَ",
      "englishText": "\"My Lord, build for me near You a house in Paradise and save me from Pharaoh and his deeds and save me from the wrongdoing people.\"",
      "hindiText": "परवरदिगार मेरे लिए अपने यहाँ बेहिश्त में एक घर बना और मुझे फिरऔन और उसकी कारस्तानी से नजात दे और मुझे ज़ालिम लोगो (के हाथ) से छुटकारा अता फ़रमा",
      "urduText": "اے میرے رب! میرے لیے اپنے پاس جنت میں مکان بنا اور مجھے فرعون سے اور اس کے عمل سے بچا اور مجھے ﻇالم لوگوں سے خلاصی دے",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 66,
          "ayahNumber": 11
        }
      ]
    },
    {
      "arabicText": "سُبحانَ رَبِّنا إِنّا كُنّا ظالِمينَ\nيا وَيلَنا إِنّا كُنّا طاغينَ\nعَسىٰ رَبُّنا أَن يُبدِلَنا خَيرًا مِنها إِنّا إِلىٰ رَبِّنا راغِبونَ",
      "englishText": "\"Exalted is our Lord! Indeed, we were wrongdoers.\"\n\"O woe to us; indeed we were transgressors.\nPerhaps our Lord will substitute for us [one] better than it. Indeed, we are toward our Lord desirous.\"",
      "hindiText": "हमारा परवरदिगार पाक है बेशक हमीं ही कुसूरवार हैं\nहाए अफसोस बेशक हम ही ख़ुद सरकश थे\nउम्मीद है कि हमारा परवरदिगार हमें इससे बेहतर बाग़ इनायत फ़रमाए हम अपने परवरदिगार की तरफ रूजू करते हैं",
      "urduText": "ہمارا رب پاک ہے بیشک ہم ہی ﻇالم تھے\nہائے افسوس! یقیناً ہم سرکش تھے\nکیا عجب ہے کہ ہمارا رب ہمیں اس سے بہتر بدلہ دے دے ہم تو اب اپنے رب سے ہی آرزو رکھتے ہیں",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 68,
          "ayahNumber": 29
        },
        {
          "surahNumber": 68,
          "ayahNumber": 31
        },
        {
          "surahNumber": 68,
          "ayahNumber": 32
        }
      ]
    },
    {
      "arabicText": "قُل هُوَ اللَّهُ أَحَدٌ\nاللَّهُ الصَّمَدُ\nلَم يَلِد وَلَم يولَد\nوَلَم يَكُن لَهُ كُفُوًا أَحَدٌ",
      "englishText": "Say, \"He is Allah, [who is] One,\nAllah, the Eternal Refuge.\nHe neither begets nor is born,\nNor is there to Him any equivalent.\"",
      "hindiText": "(ऐ रसूल) तुम कह दो कि ख़ुदा एक है\nख़ुदा बरहक़ बेनियाज़ है\nन उसने किसी को जना न उसको किसी ने जना,\nऔर उसका कोई हमसर नहीं",
      "urduText": "آپ کہہ دیجئے کہ وه اللہ تعالیٰ ایک (ہی) ہے\nاللہ تعالیٰ بے نیاز ہے\nنہ اس سے کوئی پیدا ہوا نہ وه کسی سے پیدا ہوا\nاور نہ کوئی اس کا ہمسر ہے",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 112,
          "ayahNumber": 1
        },
        {
          "surahNumber": 112,
          "ayahNumber": 2
        },
        {
          "surahNumber": 112,
          "ayahNumber": 3
        },
        {
          "surahNumber": 112,
          "ayahNumber": 4
        }
      ]
    },
    {
      "arabicText": "قُل أَعوذُ بِرَبِّ الفَلَقِ\nمِن شَرِّ ما خَلَقَ\nوَمِن شَرِّ غاسِقٍ إِذا وَقَبَ\nوَمِن شَرِّ النَّفّاثاتِ فِي العُقَدِ\nوَمِن شَرِّ حاسِدٍ إِذا حَسَدَ",
      "englishText": "Say, \"I seek refuge in the Lord of daybreak\nFrom the evil of that which He created\nAnd from the evil of darkness when it settles\nAnd from the evil of the blowers in knots\nAnd from the evil of an envier when he envies.\"",
      "hindiText": "(ऐ रसूल) तुम कह दो कि मैं सुबह के मालिक की\nहर चीज़ की बुराई से जो उसने पैदा की पनाह माँगता हूँ\nऔर अंधेरीरात की बुराई से जब उसका अंधेरा छा जाए\nऔर गन्डों पर फूँकने वालियों की बुराई से\n(जब फूँके) और हसद करने वाले की बुराई से",
      "urduText": "آپ کہہ دیجئے! کہ میں صبح کے رب کی پناه میں آتا ہوں\nہر اس چیز کے شر سے جو اس نے پیدا کی ہے\nاور اندھیری رات کی تاریکی کے شر سے جب اس کا اندھیرا پھیل جائے\nاور گره (لگا کر ان) میں پھونکنے والیوں کے شر سے (بھی)\nاور حسد کرنے والے کی برائی سے بھی جب وه حسد کرے",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 113,
          "ayahNumber": 1
        },
        {
          "surahNumber": 113,
          "ayahNumber": 2
        },
        {
          "surahNumber": 113,
          "ayahNumber": 3
        },
        {
          "surahNumber": 113,
          "ayahNumber": 4
        },
        {
          "surahNumber": 113,
          "ayahNumber": 5
        }
      ]
    },
    {
      "arabicText": "قُل أَعوذُ بِرَبِّ النّاسِ\nمَلِكِ النّاسِ\nإِلٰهِ النّاسِ\nمِن شَرِّ الوَسواسِ الخَنّاسِ\nالَّذي يُوَسوِسُ في صُدورِ النّاسِ\nمِنَ الجِنَّةِ وَالنّاسِ",
      "englishText": "Say, \"I seek refuge in the Lord of mankind,\nThe Sovereign of mankind.\nThe God of mankind,\nFrom the evil of the retreating whisperer -\nWho whispers [evil] into the breasts of mankind -\nFrom among the jinn and mankind.\"",
      "hindiText": "(ऐ रसूल) तुम कह दो मैं लोगों के परवरदिगार\nलोगों के बादशाह\nलोगों के माबूद की (शैतानी)\nवसवसे की बुराई से पनाह माँगता हूँ\nजो (ख़ुदा के नाम से) पीछे हट जाता है जो लोगों के दिलों में वसवसे डाला करता है\nजिन्नात में से ख्वाह आदमियों में से",
      "urduText": "آپ کہہ دیجئے! کہ میں لوگوں کے پروردگار کی پناه میں آتا ہوں\nلوگوں کے مالک کی (اور)\nلوگوں کے معبود کی (پناه میں)\nوسوسہ ڈالنے والے پیچھے ہٹ جانے والے کے شر سے\nجو لوگوں کے سینوں میں وسوسہ ڈالتا ہے\n(خواه) وه جن میں سے ہو یا انسان میں سے",
      "phraseType": "prayer",
      "references": [
        {
          "surahNumber": 114,
          "ayahNumber": 1
        },
        {
          "surahNumber": 114,
          "ayahNumber": 2
        },
        {
          "surahNumber": 114,
          "ayahNumber": 3
        },
        {
          "surahNumber": 114,
          "ayahNumber": 4
        },
        {
          "surahNumber": 114,
          "ayahNumber": 5
        },
        {
          "surahNumber": 114,
          "ayahNumber": 6
        }
      ]
    }
  ]
}